{
    "m1": {
        "to": "Messier 1",
        "title": "Crab Nebula",
        "extract": "The Crab Nebula (catalogue designations M1, NGC 1952, Taurus A) is a supernova remnant in the constellation of Taurus. The current name is due to William Parsons, 3rd Earl of Rosse, who observed the object in 1840 using a 36-inch telescope and produced a drawing that looked somewhat like a crab. Corresponding to a bright supernova recorded by Chinese astronomers in 1055, the nebula was observed later by English astronomer John Bevis in 1732. The nebula was the first astronomical object identified with a historical supernova explosion.\nAt an apparent magnitude of 8.4, comparable to that of Saturn's moon Titan, it is not visible to the naked eye but can be made out using binoculars under favourable conditions. The nebula lies in the  Perseus Arm of the Milky Way galaxy, at a distance of about 3.0 kiloparsecs (6,500 ly) from Earth. It has a diameter of 3.4 parsecs (11 ly), corresponding to an apparent diameter of some 7 arcminutes, and is expanding at a rate of about 1,500 kilometres per second (930 mi/s), or 0.5% of the speed of light.\nAt the center of the nebula lies the Crab Pulsar, a neutron star 28–30 kilometres (17–19 mi) across with a spin rate of 30.2 times per second, which emits pulses of radiation from gamma rays to radio waves. At X-ray and gamma ray energies above 30 keV, the Crab Nebula is generally the brightest persistent source in the sky, with measured flux extending to above 10 TeV. The nebula's radiation allows detailed study of celestial bodies that occult it. In the 1950s and 1960s, the Sun's corona was mapped from observations of the Crab Nebula's radio waves passing through it, and in 2003, the thickness of the atmosphere of Saturn's moon Titan was measured as it blocked out X-rays from the nebula."
    },

    "m2": {
        "to": "Messier 2",
        "title": "Messier 2",
        "extract": "Messier 2 or M2 (also designated NGC 7089) is a globular cluster in the constellation Aquarius, five degrees north of the star Beta Aquarii. It was discovered by Jean-Dominique Maraldi in 1746, and is one of the largest known globular clusters."
    },

    "m3": {
        "to": "Messier 3",
        "title": "Messier 3",
        "extract": "Messier 3 (M3  or NGC 5273) is a globular cluster of stars in the northern constellation of Canes Venatici. It was discovered on May 3, 1764, and was the first Messier object to be discovered by Charles Messier himself. Messier originally mistook the object for a nebula without stars. This mistake was corrected after the stars were resolved by William Herschel around 1784. Since then, it has become one of the best-studied globular clusters. Identification of the cluster's unusually large variable star population was begun in 1913 by American astronomer Solon Irving Bailey and new variable members continue to be identified up through 2004.Many amateur astronomers consider it one of the finest northern globular clusters, following only Messier 13. M3 has an apparent magnitude of 6.2, making it a difficult naked eye target even with dark conditions. With a moderate-sized telescope, the cluster is fully defined. It can be a challenge to locate through the technique of star hopping, but can be found by looking almost exactly halfway along an imaginary line connecting the bright star Arcturus to Cor Caroli. Using a telescope with a 25 cm (9.8 in) aperture, the cluster has a bright core with a diameter of about 6 arcminutes and spans a total of 12 arcminutes.This cluster is one of the largest and brightest, and is made up of around 500,000 stars. It is estimated to be 8 billion years old. It is located at a distance of about 33,900 light-years away from Earth.Messier 3 is located 31.6 kly (9.7 kpc) above the Galactic plane and roughly 38.8 kly (11.9 kpc) from the center of the Milky Way. It contains 274 known variable stars; by far the highest number found in any globular cluster. These include 133 RR Lyrae variables, of which about a third display the Blazhko effect of long-period modulation. The overall abundance of elements other than hydrogen and helium, what astronomers term the metallicity, is in the range of –1.34 to –1.50 dex. This value gives the logarithm of the abundance relative to the Sun; the actual proportion is 3.2–4.6% of the solar abundance. Messier 3 is the prototype for the Oosterhoff type I cluster, which is considered \"metal-rich\". That is, for a globular cluster, Messier 3 has a relatively high abundance of heavier elements."
    },

    "m4": {
        "to": "Messier 4",
        "title": "Messier 4",
        "extract": "Messier 4 or M4 (also designated NGC 6121) is a globular cluster in the constellation of Scorpius.  It was discovered by Philippe Loys de Chéseaux in 1745 and catalogued by Charles Messier in 1764. It was the first globular cluster in which individual stars were resolved.\n\n"
    },

    "m5": {
        "to": "Messier 5",
        "title": "Messier 5",
        "extract": "Messier 5 or M5 (also designated NGC 5904) is a globular cluster in the constellation Serpens. It was discovered by Gottfried Kirch in 1702."
    },

    "m6": {
        "to": "Messier 6",
        "title": "Butterfly Cluster",
        "extract": "The Butterfly Cluster (cataloged as Messier 6 or M6, and as NGC 6405) is an open cluster of stars in the southern constellation of Scorpius. Its name derives from the vague resemblance of its shape to a butterfly. The Trumpler classification of II 3 r indicates it is rich in stars (r) with a high concentration (II) and a large range of brightness (3). It is positioned 3.5° to the northwest of Messier 7 near the tail of Scorpius.The first astronomer to record the Butterfly Cluster's existence was Giovanni Battista Hodierna in 1654. However, Robert Burnham, Jr. has proposed that the 1st century astronomer Ptolemy may have seen it with the naked eye while observing its neighbor the Ptolemy Cluster (M7). Credit for the discovery is usually given to Jean-Philippe Loys de Chéseaux in 1746. Charles Messier observed the cluster on May 23, 1764 and added it to his Messier Catalog.Estimates of the Butterfly Cluster's distance have varied over the years. Wu et al. (2009) found a distance estimate of 1,590 light-years, giving it a spatial dimension of some 12 light years. Modern measurements show its total visual brightness to be magnitude 4.2. The cluster is estimated to be 94.2 million years old. Cluster members show a slightly higher abundance of elements heavier than helium compared to the Sun; what astronomers refer to as the metallicity.\n120 stars, ranging down to visual magnitude 15.1, have been identified as most likely cluster members. Most of the bright stars in this cluster are hot, blue B-type stars but the brightest member is a K-type orange giant star, BM Scorpii, which contrasts sharply with its blue neighbours in photographs. BM Scorpii, is classed as a semiregular variable star, its brightness varying from magnitude +5.5 to magnitude +7.0. There are also eight candidate chemically peculiar stars.The cluster is located 24.59 ± 0.13 kly (7.54 ± 0.04 kpc) from the Galactic Center and is following an orbit through the Milky Way galaxy with a low eccentricity of 0.03 and an orbital period of 204.2 Myr. At present it is 23 ly (7 pc) below the galactic plane, and it will cross the plane every 29.4 Myr."
    },

    "m7": {
        "to": "Messier 7",
        "title": "Messier 7",
        "extract": "Messier 7 or M7, also designated NGC 6475 and sometimes known as the Ptolemy Cluster, is an open cluster of stars in the constellation of Scorpius. The cluster is easily detectable with the naked eye, close to the \"stinger\" of Scorpius. With a declination of -34.8°, it is the southernmost Messier object.\nM7 has been known since antiquity; it was first recorded by the 2nd-century Greek-Roman astronomer Ptolemy, who described it as a nebula in 130 AD. Italian astronomer Giovanni Batista Hodierna observed it before 1654 and counted 30 stars in it. In 1764, French astronomer Charles Messier catalogued the cluster as the seventh member in his list of comet-like objects. English astronomer John Herschel described it as \"coarsely scattered clusters of stars\".\n\nTelescopic observations of the cluster reveal about 80 stars within a field of view of 1.3° across. At the cluster's estimated distance of 980 light years this corresponds to an actual diameter of 25 light years. The tidal radius of the cluster is 40.1 ly (12.3 pc) and it has a combined mass of about 735 times the mass of the Sun. The age of the cluster is around 200 million years while the brightest member star is of magnitude 5.6. In terms of composition, the cluster contains a similar abundance of elements other than hydrogen and helium as the Sun.On Aug. 29, 2006, Messier 7 was used for first light image of the Long Range Reconnaissance Imager (LORRI) telescope on the Pluto-bound New Horizons spacecraft."
    },

    "m8": {
        "to": "Messier 8",
        "title": "Lagoon Nebula",
        "extract": "The Lagoon Nebula (catalogued as Messier 8 or M8, NGC 6523, Sharpless 25, RCW 146, and Gum 72) is a giant interstellar cloud in the constellation Sagittarius. It is classified as an emission nebula and as an H II region.\nThe Lagoon Nebula was discovered by Giovanni Hodierna before 1654 and is one of only two star-forming nebulae faintly visible to the eye from mid-northern latitudes. Seen with binoculars, it appears as a distinct oval cloudlike patch with a definite  core. Within the nebula is the open cluster NGC 6530."
    },

    "m9": {
        "to": "Messier 9",
        "title": "Messier 9",
        "extract": "Messier 9 or M9 (also designated NGC 6333) is a globular cluster in the constellation of Ophiuchus. It is positioned in the southern part of the constellation to the southwest of Eta Ophiuchi, and lies atop a dark cloud of dust designated Barnard 64. The cluster was discovered by French astronomer Charles Messier on June 3, 1764, who described it as a \"nebula without stars\". In 1783, English astronomer William Herschel was able to use his reflector to resolve individual stars within the cluster. He found the cluster to be 7−8′ in diameter with stars densely packed near the center.M9 has an apparent magnitude of 7.9, an angular size of 9.3′, and can be viewed with a small telescope. It is one of the nearer globular clusters to the center of the Milky Way Galaxy with a separation of around 5,500 light-years from the Galactic Core. Its distance from Earth is 25,800 light-years.\nThe total luminosity of this cluster is around 120,000 times that of the Sun, the absolute magnitude being -8.04. The brightest individual stars in M9 are of apparent magnitude 13.5, making them visible in moderately sized telescopes. There have been 24 variable stars found in M9: 21 RR Lyrae variables, plus a long-period variable, Type II Cepheid, and an eclipsing binary. No blue stragglers or SX Phoenicis variables have been discovered. Based upon the periods of the RR Lyr variables, this cluster is classified as an Oosterhoff type II globular, which precludes an extra-galactic origin.Nearby, at about 80' to the northeast of M9 is the dimmer globular cluster NGC 6356, while at about 80' to the southeast is the globular NGC 6342."
    },

    "m10": {
        "to": "Messier 10",
        "title": "Messier 10",
        "extract": "Messier 10 or M10 (also designated NGC 6254) is a globular cluster of stars in the equatorial constellation of Ophiuchus. The object was discovered by the French astronomer Charles Messier on May 29, 1764, who cataloged it as number 10 in his catalogue and described it as a \"nebula without stars\". In 1774, German astronomer Johann Elert Bode likewise called it a \"nebulous patch without stars; very pale\". Using larger instrumentation, German-born astronomer William Herschel was able to resolve the cluster into its individual members. He described it as a \"beautiful cluster of extremely compressed stars\". William Parsons, 3rd Earl of Rosse thought he could distinguish a dark lane through part of the cluster. The first to estimate the distance to the cluster was Harlow Shapley, although his derivation of 33,000 light years was much further than the modern value.\n\nThe tidal radius of M10 is 19.3 arcminutes, which is about two-thirds of the apparent diameter of the Moon. Viewed through medium-sized telescopes it appears about half that size (8–9 arcminutes), as its bright core is only 35 light-years across. It has a core radius of 48 arcseconds and a half-mass radius of 147 arcseconds (2.5 arcminutes). M10 has a spatial diameter of 83 light-years and is estimated to be 14,300 light-years away from Earth.In terms of the abundance of elements other than hydrogen and helium, what astronomers term the metallicity, Messier 10 is \"moderately metal–poor\". The abundance of iron, measured as [Fe/H] equals –1.45 ± 0.04 dex, is only 3.5% of the abundance found at the surface of the Sun. The cluster shows evidence of being enriched by the elements generated through the s-process in massive stars and Type II supernovae. It shows little evidence of enrichment by Type 1a supernovae.Because binary stars are, on average, more massive than normal stars, the binaries tend to migrate toward the center of the cluster. The fraction of binary stars in the core region is about 14%. This proportion decreases with increasing radius to about 1.5% in the outlying regions of the cluster. Correspondingly, the core region contains a concentration of interaction-formed blue straggler stars, most of which formed 2–5 billion years ago. The density of stars in the core region is about 3.8 solar masses per cubic parsec. Four variable stars have been discovered in this cluster.\nThe cluster is currently located about 5 kiloparsecs (16 kly) from the Galactic Center. It completes an orbit around the Milky Way galaxy about every 140 million years, during which it crosses the plane of the galactic disk every 53 million years. Its rosette orbit has an eccentricity of 0.21.\n\n"
    },

    "m11": {
        "to": "Messier 11",
        "title": "Wild Duck Cluster",
        "extract": "The Wild Duck Cluster (also known as Messier 11, or NGC 6705) is an open cluster of stars in the constellation Scutum (the Shield). It was discovered by Gottfried Kirch in 1681. Charles Messier included it in his catalogue of diffuse objects in 1764. Its popular name derives from the brighter stars forming a triangle which could resemble a flying flock of ducks (or, from other angles, one swimming duck). The cluster is located just to the east of the Scutum Star Cloud midpoint.The Wild Duck Cluster is one of the richest and most compact of the known open clusters. It is one of the most massive open clusters known, and it has been extensively studied. Its age has been estimated to about 316 million years. The core radius is 1.23 pc while the tidal radius is 29 pc. Estimates for the cluster's mass range from 3,700 M☉ to 11,000 M☉, depending on the method chosen, The brightest cluster member is visual magnitude 8, and it has 870 members of at least magnitude 16.5. It has an integrated absolute magnitude of –6.5, and a visual extinction of 1.3.The cluster is metal-rich with an iron abundance of [Fe/H] = 0.17±0.04. Despite its youth, it shows an enhancement of Alpha process elements. Possibly this is due to an enhancement of its birth molecular cloud by a nearby Type II supernova explosion. At least nine variable star members have been identified with high probability, plus 29 lower probability members. The former include two eclipsing binary star systems. The cluster is located 6.8 kpc from the galactic center, close to the galactic plane, and is not far from its birthplace."
    },

    "m12": {
        "to": "Messier 12",
        "title": "Messier 12",
        "extract": "Messier 12 or M 12 (also designated NGC 6218) is a globular cluster in the constellation of Ophiuchus. It was discovered by the French astronomer Charles Messier on May 30, 1764, who described it as a \"nebula without stars\". In dark conditions this cluster can be faintly seen with a pair of binoculars. Resolving the stellar components requires a telescope with an aperture of 8 in (20 cm) or greater. In a 10 in (25 cm) scope, the granular core shows a diameter of 3′ (arcminutes) surrounded by a 10′ halo of stars.Located roughly 3° in the sky from the cluster M10 and 5.6° from the star Lambda Ophiuchi, M12 is about 15,700 light-years (4,800 parsecs) from Earth and has a spatial diameter of about 75 light-years. The brightest stars of M12 are of 12th magnitude. With a Shapley-Sawyer rating of IX, it is rather loosely packed for a globular and was once thought to be a tightly concentrated open cluster. Thirteen variable stars have been recorded in this cluster. M12 is approaching us at a velocity of 16 km/s.A study published in 2006 concluded that this cluster has an unusually low number of low mass stars. The authors surmise that they were stripped from the cluster by the gravitational influence of the Milky Way."
    },

    "m13": {
        "to": "Messier 13",
        "title": "Messier 13",
        "extract": "Messier 13 or M13, also designated NGC 6205 and sometimes called the Great Globular Cluster in Hercules or the Hercules Globular Cluster, is a globular cluster of several hundred thousand stars in the constellation of Hercules."
    },

    "m14": {
        "to": "Messier 14",
        "title": "Messier 14",
        "extract": "Messier 14 (also known as M14 or NGC 6402) is a globular cluster of stars in the constellation Ophiuchus. It was discovered by Charles Messier in 1764.\nAt a distance of about 30,000 light-years, M14 contains several hundred thousand stars. At an apparent magnitude of +7.6 it can be easily observed with binoculars. Medium-sized telescopes will show some hint of the individual stars of which the brightest is of magnitude +14.\nThe total luminosity of M14 is in the order of 400,000 times that of the Sun corresponding to an absolute magnitude of -9.12. The shape of the cluster is decidedly elongated. M14 is about 100 light-years across.\nA total of 70 variable stars are known in M14, many of the W Virginis variety common in globular clusters. In 1938, a nova appeared, although this was not discovered until photographic plates from that time were studied in 1964. It is estimated that the nova reached a maximum brightness of magnitude +9.2, over five times brighter than the brightest 'normal' star in the cluster.\nSlightly over 3° southwest of M14 lies the faint globular cluster NGC 6366."
    },

    "m15": {
        "to": "Messier 15",
        "title": "Messier 15",
        "extract": "Messier 15 or M15 (also designated NGC 7078) is a globular cluster in the constellation Pegasus. It was discovered by Jean-Dominique Maraldi in 1746 and included in Charles Messier's catalogue of comet-like objects in 1764.  At an estimated 12.0 billion years old, it is one of the oldest known globular clusters."
    },

    "m16": {
        "to": "Messier 16",
        "title": "Eagle Nebula",
        "extract": "The Eagle Nebula (catalogued as Messier 16 or M16, and as NGC 6611, and also known as the Star Queen Nebula and The Spire) is a young open cluster of stars in the constellation Serpens, discovered by Jean-Philippe de Chéseaux in 1745–46.  Both the \"Eagle\" and the \"Star Queen\" refer to visual impressions of the dark silhouette near the center of the nebula, an area made famous as the \"Pillars of Creation\" imaged by the Hubble Space Telescope.  The nebula contains several active star-forming gas and dust regions, including the aforementioned Pillars of Creation."
    },

    "m17": {
        "to": "Messier 17",
        "title": "Omega Nebula",
        "extract": "The Omega Nebula, also known as the Swan Nebula, Checkmark Nebula, and the Horseshoe Nebula (catalogued as Messier 17 or M17 or NGC 6618) is an H II region in the constellation Sagittarius. It was discovered by Philippe Loys de Chéseaux in 1745. Charles Messier catalogued it in 1764. It is located in the rich starfields of the Sagittarius area of the Milky Way."
    },

    "m18": {
        "to": "Messier 18",
        "title": "Messier 18",
        "extract": "Messier 18 or M18, also designated NGC 6613, is an open cluster of stars in the constellation Sagittarius. It was discovered by Charles Messier in 1764 and included in his list of comet-like objects. From the perspective of Earth, M18 is situated between the Omega Nebula (M17) and the Sagittarius Star Cloud (M24).This is a sparse cluster with a linear diameter of 8.04 pc, a tidal radius of 7.3 pc, and is centrally concentrated with core radius of 0.012 pc. It has a Trumpler class of II 3 p. The cluster is 33 million years old with an estimated mass of 188 M☉. It has one definite Be star and 29 B-type stars in total. There are three supergiant stars, all of class A or earlier. The brightest component (lucida), designated HD 168352, is a B-type giant star with a class of B2 III and a visual magnitude of 8.65.Messier 18 is 1,296 pc from the Earth and 6,830 pc from the Galactic Center. It is orbiting the Milky Way core with a period of 186.5 million years and an eccentricity of 0.02. This carries it to as close as 6.5 kpc to, and as far as 6.8 kpc from the galactic core. It passes vertically through the galactic plane once every 27.4 million years, ranging no more than 80 pc above or below."
    },

    "m19": {
        "to": "Messier 19",
        "title": "Messier 19",
        "extract": "Messier 19 or M19 (also designated NGC 6273) is a globular cluster in the constellation Ophiuchus. It was discovered by Charles Messier on June 5, 1764 and added to his catalogue of comet-like objects that same year. It was resolved into individual stars by William Herschel in 1784. His son, John Herschel, described it as \"a superb cluster resolvable into countless stars\". The cluster is located 4.5° WSW of Theta Ophiuchi and is just visible as a fuzzy point of light using 50 mm (2.0 in) binoculars. Using a telescope with a 25.4 cm (10.0 in) aperture, the cluster shows an oval appearance with a 3′ × 4′ core and a 5′ × 7′ halo.M19 is one of the most oblate of the known globular clusters. This flattening may not accurately reflect the physical shape of the cluster because the emitted light is being strongly absorbed along the eastern edge. This is the result of extinction caused by intervening gas and dust. When viewed in the infrared, the cluster shows almost no flattening. It lies at a distance of about 28.7 kly (8.8 kpc) from the Solar System, and is quite near to the Galactic Center at only about 6.5 kly (2.0 kpc) away.This cluster contains an estimated 1,100,000 times the mass of the Sun and it is around 11.9 billion years old. The stellar population includes four Cepheids and RV Tauri variables, plus at least one RR Lyrae variable for which a period is known. Observations made during the ROSAT mission failed to reveal any low-intensity X-ray sources.\n\n\t\t\n\t\t\n\n"
    },

    "m20": {
        "to": "Messier 20",
        "title": "Trifid Nebula",
        "extract": "The Trifid Nebula (catalogued as Messier 20 or M20 and as NGC 6514) is an H II region located in Sagittarius. It was discovered by Charles Messier on June 5, 1764. Its name means 'divided into three lobes'. The object is an unusual combination of an open cluster of stars; an emission nebula (the lower, red portion), a reflection nebula (the upper, blue portion) and a dark nebula (the apparent 'gaps' within the emission nebula that cause the trifurcated appearance; these are also designated Barnard 85). Viewed through a small telescope, the Trifid Nebula is a bright and peculiar object, and is thus a perennial favorite of amateur astronomers.The Trifid Nebula is a star-forming region in the Scutum spiral arm of the Milky Way.\nThe most massive star that has formed in this region is HD 164492A, an O7.5III star with a mass more than 20 times the mass of the Sun.\nThis star is surrounded by a cluster of approximately 3100 young stars."
    },

    "m21": {
        "to": "Messier 21",
        "title": "Messier 21",
        "extract": "Messier 21 or M21, also designated NGC 6531, is an open cluster of stars in the constellation of Sagittarius. It was discovered and catalogued by Charles Messier on June 5, 1764. This cluster is relatively young and tightly packed. A few blue giant stars have been identified in the cluster, but Messier 21 is composed mainly of small dim stars. With a magnitude of 6.5, M21 is not visible to the naked eye; however, with the smallest binoculars it can be easily spotted on a dark night. The cluster is positioned near the Trifid nebula (NGC 6514), but is not associated with that nebulosity. It forms part of the Sagittarius OB1 association.This cluster is located 1,205 pc away from Earth with an extinction of 0.87. Messier 21 is around 6.6 million years old with a mass of 783.4 M☉. It has a tidal radius of 11.7 pc, with a nucleus radius of 1.6±0.1 pc and a coronal radius of 3.6±0.2 pc. There are at least 105±11 members within the coronal radius down to visual magnitude 15.5, including many early B-type stars. An estimated 40–60 of the observed low-mass members are expected to be pre-main-sequence stars, with 26 candidates identified based upon hydrogen alpha emission and the presence of lithium in the spectrum. The stars in the cluster do not show a significant spread in ages, suggesting that the star formation was triggered all at once.\n\n"
    },

    "m22": {
        "to": "Messier 22",
        "title": "Messier 22",
        "extract": "Messier 22 or M22, also known as NGC 6656, is an elliptical globular cluster of stars in the constellation Sagittarius, near the Galactic bulge region.  It is one of the brightest globulars that is visible in the night sky. The brightest stars are 11th magnitude, with hundreds of stars bright enough to resolve with an 8\" telescope. M22 is located just south of the Ecliptic, and northwest of Lambda Sagittarii (Kaus Borealis), the northernmost star of the \"Teapot\" asterism.\nM22 was one of the first globulars to be discovered, on August 26, 1665 by Abraham Ihle and it was included in Charles Messier's catalog of comet-like objects on June 5, 1764. It was one of the first globular clusters to be carefully studied first by Harlow Shapley in 1930. He discovered roughly 70,000 stars and found it had a dense core. Then Halton Arp and William G. Melbourne continued studies in 1959. Because of the large color spread of its red giant branch (RGB) sequence, which is similar to that observed in Omega Centauri, it became the object of intense scrutiny starting in 1977 with James E. Hesser et al.M22 is one of the nearer globular clusters to Earth at a distance of about 10,600 light-years away. It spans 32' on the sky which translates to a spatial diameter of 99 ± 9 light-years. 32 variable stars have been recorded in M22.  It is projected in front of the galactic bulge and is therefore useful for its microlensing effect on the background stars in the bulge.Despite its relative proximity to us, this metal-poor cluster's light is limited by dust extinction, giving it an apparent magnitude of 5.5 making it the brightest globular cluster visible from mid-northern latitudes (e.g. Europe and most of North America). However, due to its southerly declination, M22 never rises high in the sky and so appears less impressive to northern hemisphere observers than other summer sky globulars such as M13 and M5.\nM22 is very unusual in that it is one of only four globulars (the others being M15, NGC 6441 and Palomar 6) that are known to contain a planetary nebula.  It was discovered using the IRAS satellite by Fred Gillett et al.,in 1986 as a pointlike source (IRAS 18333-2357) and subsequently identified as a planetary nebula in 1989 by Gillett et al. The planetary nebula's central star is a blue star.  The planetary nebula (designated GJJC1) is estimated to be a mere ~6,000 years old.Two black holes of between 10 and 20 solar masses each have been discovered, initially with the Very Large Array radio telescope in New Mexico, and corroborated by the Chandra X-ray telescope, in 2012. Their detection implies that gravitational ejection of black holes from clusters is not as efficient as was previously thought, and leads to estimates of a total 5 to 100 black holes within M22. Interactions between stars and black holes could explain the unusually large core of the cluster.\n\n"
    },

    "m23": {
        "to": "Messier 23",
        "title": "Messier 23",
        "extract": "Messier 23, also known as NGC 6494, is an open cluster of stars in the southern constellation of Sagittarius. It was discovered by Charles Messier on June 20, 1764. M23 can be found with binoculars or a modestly sized telescope. The cluster is positioned in front of \"an extensive gas and dust network\", although it is unclear if there is an association between the two. It is located near the ecliptic and thus is subject to lunar occultations.The cluster is located 2,050 light years away. Estimates for the number of cluster members range from 169 up to 414, with a directly-counted mass of 1,206 M☉; 1,332 M☉ by application of the virial theorem. The cluster is around 330 million years old with a near-solar metallicity of [Fe/H] = −0.04. The brightest component (lucida) is of magnitude 9.3. Five of the cluster members are candidate red giants, while the variable VV Sgr is a candidate asymptotic giant branch star.\n\n"
    },

    "m24": {
        "to": "Messier 24",
        "title": "Sagittarius Star Cloud",
        "extract": "The Sagittarius Star Cloud (also known as Messier 24 and IC 4715) is a star cloud in the constellation of Sagittarius, approximately 600 light years wide, which was discovered by Charles Messier in 1764. It is sometimes known as the Small Sagittarius Star Cloud to distinguish it from the Great Sagittarius Star Cloud located to the north of Gamma Sagittarii and Delta Sagittarii.The stars, clusters and other objects comprising M24 are part of the Sagittarius or Sagittarius-Carina arms of the Milky Way galaxy. Messier described M24 as a \"large nebulosity containing many stars\" and gave its dimensions as being some 1.5° across. Some sources, improperly, identify M24 as the faint cluster NGC 6603. The location of the Sagittarius Star Cloud is near the Omega Nebula (also known as M17) and open cluster Messier 18, north of M24. M24 is one of only three Messier objects that are not deep sky objects.M24 fills a space of significant volume to a depth of 10,000 to 16,000 light-years. This is the most dense concentration of individual stars visible using binoculars, with around 1,000 stars visible within a single field of view. The star cloud can be seen visible when the Milky Way itself is visible as well. Without the dust and gas that conceals the Milky Way, M24 holds a collection of numerous kinds of stars that are placed along the Milky Way and through the galaxy's obscuring band of interstellar dust.HD 167356 is the brightest star that is located within the Sagittarius Star Cloud, a white supergiant with an apparent magnitude of 6.05. This star is an Alpha-2 Canum Venaticorum variable, showing small changes in brightness as it rotates.  There are three other stars located in M24 with visual magnitudes between 6.5 and 7.0.The star cloud incorporates two prominent dark nebulae which are vast clouds of dense, obscuring interstellar dust. This dust blocks light from the more distant stars, which keeps them from being seen from Earth. Lying on the northwestern side is Barnard 92, which is the darkest out of the two. Inside the field filled with stars, the nebula appears as an immense round hole that is devoid of any stars. American astronomer Edward Emerson Barnard discovered this dark nebula in 1913. Along the northeast side contains Barnard 93, which is less obvious and large as the other dark nebula. There are also other dark nebulae within M24, including Barnard 304 and Barnard 307. Both Barnard 92 and 93 have the most significant features shown in M24 due to them both blocking out several stars and being the most visually prominent.The Sagittarius Star Cloud also holds two planetary nebulae, M 1-43 and NGC 6567. Located within a spiral arm of the Milky Way, Messier 24 holds some similarities with NGC 206, a bright, large star cloud."
    },

    "m25": {
        "to": "Messier 25",
        "title": "Messier 25",
        "extract": "Messier 25, also known as IC 4725, is an open cluster of stars in the southern constellation of Sagittarius. The first recorded observation of this cluster was made by Philippe Loys de Chéseaux in 1745 and it was included in Charles Messier's list of nebulous objects in 1764. The cluster is located near some obscuring features, with a dark lane passing near the center.M25 is at a distance of about 2,000 light-years light-years away from Earth and is 67.6 million years old. The spatial dimension of this cluster is about 13 light-years across. It has an estimated mass of 1,937 M☉, of which about 24% is interstellar matter. A Delta Cephei type variable star designated U Sagittarii is a member of this cluster, as are two red giants, one of which is a binary system."
    },

    "m26": {
        "to": "Messier 26",
        "title": "Messier 26",
        "extract": "Messier 26, also known as NGC 6694, is an open cluster of stars in the southern constellation of Scutum. It was discovered by Charles Messier on June 20, 1764. This 8th magnitude cluster is a challenge to find with typical binoculars, but can be spotted with an 80mm aperture. It is positioned near the open cluster Messier 11 and is 14′ across. About 25 stars are visible in a telescope with a 150–200 mm (6–8 in) aperture.M26 spans a linear size of 22 light years across with a tidal radius of 25 light-years, and is at a distance of 5,160 light years from the Earth. The brightest star is of magnitude 11 and the age of this cluster has been calculated to be 85.3 million years. It includes one known spectroscopic binary system.An interesting feature of M26 is a region of low star density near the nucleus. A hypothesis was that it was caused by an obscuring cloud of interstellar matter between us and the cluster, but a paper by James Cuffey suggested that this is not possible and that it really is a \"shell of low stellar space density\". In 2015, Michael Merrifield of the University of Nottingham said that there is, as yet, no clear explanation for the phenomenon.\n\n"
    },

    "m27": {
        "to": "Messier 27",
        "title": "Dumbbell Nebula",
        "extract": "The Dumbbell Nebula (also known as Apple Core Nebula, Messier 27, M 27, or NGC 6853) is a planetary nebula in the constellation Vulpecula, at a distance of about 1227 light-years. This object was the first planetary nebula to be discovered; by Charles Messier in 1764. At its brightness of visual magnitude 7.5 and its diameter of about 8 arcminutes, it is easily visible in binoculars, and a popular observing target in amateur telescopes."
    },

    "m28": {
        "to": "Messier 28",
        "title": "Messier 28",
        "extract": "Messier 28 or M28, also known as NGC 6626, is a globular cluster of stars in the constellation Sagittarius. It was discovered by French astronomer Charles Messier on July 27, 1764. He briefly described it as a \"nebula containing no star... round, seen with difficulty in 3½-foot telescope; Diam 2′.\" The 2′ at the end indicates an angle of two arcminutes.In the sky it is less than a degree to the northwest of the 3rd magnitude star Kaus Borealis. This cluster is faintly visible as a hazy patch with a pair of binoculars and can be readily found in a small telescope with a 8 cm (3.1 in) aperture, showing as a nebulous feature spanning 11.2 arcminutes. At 15 cm (5.9 in), the core becomes visible and a few individual stars can be resolved along the periphery. Larger telescopes will provide greater resolution, with a 25 cm (9.8 in) telescope revealing a 2′ core.M28 is at a distance of about 17,900 light-years away from Earth. It has a combined 551,000 times the mass of the Sun and is 12 billion years old. 18 RR Lyrae type variable stars have been observed in this cluster. In 1986, M28 became the first globular cluster where a millisecond pulsar, PSR B1821–24, was discovered with the Lovell Telescope at Jodrell Bank Observatory. A total of 11 additional millisecond pulsars have since been detected in the cluster with the Green Bank Telescope. As of 2011, this is the third largest known population of pulsars in a cluster following Terzan 5 and 47 Tucanae.\n\n"
    },

    "m29": {
        "to": "Messier 29",
        "title": "Messier 29",
        "extract": "Messier 29 or M 29, also known as NGC 6913, is an open cluster of star in the Cygnus constellation. It was discovered by Charles Messier in 1764, and can be seen from Earth by using binoculars.\nThe star cluster is situated in the highly crowded area of Milky Way near Gamma Cygni, at a distance of 7,200 (most sources including Mallas/Kreimer and Burnham, and agreeing with early estimates or R.J. Trumpler 1930) or 4,000 light years (the latter from Kenneth Glyn Jones and the Sky Catalogue 2000.0). The Night Sky Observer's Guide by Kepple and Sanner gives a deviating value of 6,000 light years – the uncertainty due to poorly known absorption of the cluster's light.\nAccording to the Sky Catalog 2000, Messier 29 is included in the Cygnus OB1 association, and is approaching us at 28 km/s. Its age is estimated at 10 million years, as its five hottest stars are all giants of spectral class B0. The Night Sky Observer's Guide gives the apparent brightness of the brightest star as 8.59 visual magnitudes. The absolute magnitude may be an impressive -8.2 mag, or a luminosity of 160,000 Suns. The linear diameter was estimated at only 11 light years. Its Trumpler class is III,3,p,n (as it is associated with nebulosity), although Götz gives, differently, II,3,m, and Kepple/Sanner gives I,2,m,n. The Sky Catalogue 2000.0 lists it with 50 member stars; earlier Becvar gave only the number of 20 members.\nThis cluster can be seen in binoculars. In telescopes, lowest powers are best. The brightest stars of Messier 29 form a \"stubby dipper\", as Mallas says it. The four brightest stars form a quadrilateral, and another three, a triangle north of them. It is often known as the \"cooling tower\" due to its resemblance to the hyperboloid-shaped structures. A few fainter stars are around them, but the cluster appears quite isolated, especially in smaller telescopes. In photographs, many faint Milky Way background stars appear.\nMessier 29 can be found quite easily as it is about 1.7 degrees south and a little east of Gamma or 37 Cygni (Sadr). In the vicinity of Messier 29, there is some diffuse nebulosity which can be detected in photographs."
    },

    "m30": {
        "to": "Messier 30",
        "title": "Messier 30",
        "extract": "Messier 30 (also known as M30 or NGC 7099) is a globular cluster of stars in the southern constellation of Capricornus. It was discovered by the French astronomer Charles Messier in 1764, who described it as a circular nebula without a star. In the New General Catalogue, compiled during the 1880s, it was described as a \"remarkable globular, bright, large, slightly oval.\" This cluster can be easily viewed with a pair of 10×50 binoculars, forming a patch of hazy light some 4 arcminutes wide that is slightly elongated along the east–west axis. With a larger instrument, individual stars can be resolved and the cluster will cover an angle of up to 12 arcminutes across with a compressed core one arcminute wide. It is best observed around August.M30 is located at a distance of about 27,100 light-years from Earth, and is about 93 light-years across. The estimated age is roughly 12.93 billion years and it has a combined mass of about 160,000 times the mass of the Sun. The cluster is following a retrograde orbit through the inner galactic halo, suggesting that it was acquired from a satellite galaxy rather than forming within the Milky Way. It is currently located at a distance of about 22.2 kly (6.8 kpc) from the center of the galaxy, compared to an estimated 26 kly (8.0 kpc) for the Sun.The M30 cluster has passed through a dynamic process called core collapse and now has a concentration of mass at its core of about a million times the Sun's mass per cubic parsec. This makes it one of the highest density regions in the Milky Way galaxy. Stars in such close proximity will experience a high rate of interactions that can create binary star systems, as well as a type of star called a blue straggler that is formed by mass transfer. A process of mass segregation may have caused the central region to gain a greater proportion of higher mass stars, creating a color gradient with increasing blueness toward the middle of the cluster."
    },

    "m31": {
        "to": "Messier 31",
        "title": "Andromeda Galaxy",
        "extract": "The Andromeda Galaxy (IPA: ), also known as Messier 31, M31, or NGC 224 and originally the Andromeda Nebula (see below), is a spiral galaxy approximately 780 kiloparsecs (2.5 million light-years) from Earth, and the nearest major galaxy to the Milky Way. The galaxy's name stems from the area of the Earth's sky in which it appears, the constellation of Andromeda.\nThe virial mass of the Andromeda Galaxy is of the same order of magnitude as that of the Milky Way, at a trillion solar masses (1012M☉). The mass of either galaxy is difficult to estimate with any accuracy, but it was long thought that the Andromeda Galaxy is more massive than the Milky Way by a margin of some 25% to 50%. This has been called into question by a 2018 study which cited a lower estimate on the mass of the Andromeda Galaxy, \ncombined with preliminary reports on a 2019 study estimating a higher mass of the Milky Way. The Andromeda Galaxy has a diameter of about 220,000 light-years, making it the largest member of the Local Group at least in terms of extension, if not mass.\nThe number of stars contained in the  Andromeda Galaxy is estimated at one trillion (1×1012), or roughly twice the number estimated for the Milky Way.The Milky Way and Andromeda galaxies are expected to collide in around 4.5 billion years, merging to form a giant elliptical galaxy or a large lenticular galaxy.\nWith an apparent magnitude of 3.4, the Andromeda Galaxy is among the brightest of the Messier objects making it visible to the naked eye from Earth on moonless nights, even when viewed from areas with moderate light pollution."
    },

    "m32": {
        "to": "Messier 32",
        "title": "Messier 32",
        "extract": "Messier 32 (also known as M32 and NGC 221) is a dwarf \"early-type\" galaxy located about 2.65 million light-years from Earth, appearing in the constellation Andromeda.  M32 is a satellite galaxy of the Andromeda Galaxy (M31) and was discovered by Guillaume Le Gentil in 1749. M32 measures 6.5 ± 0.2 thousand light-years in diameter at the widest point.The galaxy is a prototype of the relatively rare, compact elliptical (cE) galaxy class.\nHalf the stars concentrate within an effective radius of only 100 parsecs.\nDensities in the central stellar cusp increase steeply, exceeding 3×107 M⊙ pc−3 at the smallest radii resolved by HST, and the half-light radius of this central star cluster is around 6 parsec.  \nLike more ordinary elliptical galaxies, M32 contains mostly older faint red and yellow stars with practically no dust or gas and consequently no current star formation. It does, however, show hints of star formation in the relatively recent past."
    },

    "m33": {
        "to": "Messier 33",
        "title": "Triangulum Galaxy",
        "extract": "The Triangulum Galaxy is a spiral galaxy 2.73 million light-years (ly) from Earth in the constellation Triangulum. It is catalogued as Messier 33 or NGC 598. The Triangulum Galaxy is the third-largest member of the Local Group of galaxies, behind the Milky Way and the Andromeda Galaxy. It is one of the most distant permanent objects that can be viewed with the naked eye.\nThe galaxy is the smallest spiral galaxy in the Local Group and it is believed to be a satellite of the Andromeda Galaxy due to their interactions, velocities, and proximity to one another in the night sky. It also has an H II nucleus."
    },

    "m34": {
        "to": "Messier 34",
        "title": "Messier 34",
        "extract": "Messier 34 (also known as M34 or NGC 1039) is an open cluster in the constellation Perseus. It was probably discovered by Giovanni Batista Hodierna before 1654 and included by Charles Messier in his catalog of comet-like objects in 1764. Messier described it as, \"A cluster of small stars a little below the parallel of γ (Andromedae). In an ordinary telescope of 3 feet one can distinguish the stars.\"Based on the distance modulus of 8.38, this cluster is located at a distance of about 470 parsecs, or 1,500 light years. For stars in the range from 0.12 to 1.0 solar masses, M34 contains an estimated 400 members. It spans about 35' on the sky which translates to a true radius of 7.5 light years. The cluster is just visible to the naked eye in very dark conditions, well away from city lights. It is possible to see it in binoculars when light pollution is limited.The age of this cluster lies between the respective ages of the Pleiades open cluster at 100 million years and the Hyades open cluster at 800 million years. Comparisons between the observed stellar spectra and the values predicted by stellar evolutionary models gives an age estimate of 200–250 million years for M34. This is roughly the age at which stars with 0.5 solar masses enter the main sequence. By comparison, stars like the Sun enter the main sequence after 30 million years.The average proportion of elements with higher atomic numbers than helium is termed the metallicity by astronomers. This is expressed by the logarithm of the ratio of iron to hydrogen, compared to the same proportion in the Sun. For M34, the metallicity has a value of [Fe/H] = +0.07 ± 0.04. This is equivalent to a 17% higher proportion of iron compared to the Sun. Other elements show a similar abundance, with the exception of nickel which is underabundant.At least 19 members of this cluster are white dwarfs. These are stellar remnants of progenitor stars of up to eight solar masses that have evolved through the main sequence and are no longer engaged in thermonuclear fusion to generate energy. Seventeen of the white dwarfs are of spectral type DA or DAZ, while one is a type DB and the last is a type DC.\n\n"
    },

    "m35": {
        "to": "Messier 35",
        "title": "Messier 35",
        "extract": "Messier 35 or M35, also known as NGC 2168, is an open cluster of stars in the northern constellation of Gemini. It was discovered by Philippe Loys de Chéseaux around 1745 and independently discovered by John Bevis before 1750. The cluster is scattered over an area of the sky almost the size of the full moon and is located 3,870 light-years (1,186 parsecs) from Earth. The compact open cluster NGC 2158 lies directly southwest of M35.\nLeonard & Merritt (1989) computed the mass of M35 using a statistical technique based on proper motion velocities of its stars. The mass within the central 3.75 parsecs was found to be between 1600 and 3200 solar masses (95 percent confidence), consistent with the mass of a realistic stellar population within the same radius. Bouy et al. (2015) found a mass of around 1,600 M☉ within the central 27.5′ × 27.5′. There are 305 candidate members with a probability of 95% or higher, and up to 4,349 with a 50% membership probability. The cluster metallicity is given by [Fe/H] = −0.21±0.10.Of 418 probable cluster members, Leiner et al. (2015) found 64 that have variable radial velocities and thus are binary star systems. Four probable cluster members are chemically peculiar stars, while HD 41995, which lies within the cluster area, shows emission lines. Hu et al. (2005) found 13 variable stars in the cluster field, although at least three are suspect as cluster members."
    },

    "m36": {
        "to": "Messier 36",
        "title": "Messier 36",
        "extract": "Messier 36 or M36, also known as NGC 1960, is an open cluster of stars in the Auriga constellation. It was discovered by Giovanni Batista Hodierna before 1654, who described it as a nebulous patch. The cluster was independently re-discovered by Guillaume Le Gentil in 1749, then Charles Messier observed it in 1764 and added it to his catalogue. M36 is at a distance of about 1,330 pc (4,340 light years) away from Earth. The cluster is very similar to the Pleiades cluster (M45), and if it were the same distance from Earth it would be of similar magnitude.This cluster has an angular diameter of 10′ and a core radius of 3.2′. It has a mass of roughly 746 M☉ and a linear tidal radius of 10.6±1.6 pc. Based upon photometry, the age of the cluster has been estimated by Wu et al. (2009) as 25.1 Myr and 26.3+3.2−5.2 Myr by Bell et al. (2013). The luminosity of the stars that have not yet consumed their lithium implies an age of 22±4 Myr, in good agreement these previous estimates.M36 includes ten stars with a visual magnitude brighter than 10, and 178 down to magnitude 14. 38 members display an infrared excess, with one being particularly high. There is one candidate B-type variable star, which is 9th magnitude."
    },

    "m37": {
        "to": "Messier 37",
        "title": "Messier 37",
        "extract": "Messier 37 (also known as M37 or NGC 2099) is the richest open cluster in the constellation Auriga. It is the brightest of three open clusters in Auriga and was discovered by the Italian astronomer Giovanni Battista Hodierna before 1654. M37 was missed by French astronomer Guillaume Le Gentil when he rediscovered M36 and M38 in 1749. French astronomer Charles Messier independently rediscovered M37 in September 1764 but all three clusters were recorded by Hodierna. It is classified as Trumpler type I,1,r or I,2,r.\nM37 is located in the antipodal direction, opposite from the Galactic Center as seen from Earth. Estimates of its age range from 347 million to 550 million years. It has 1,500 times the mass of the Sun and contains over 500 identified stars, with roughly 150 stars brighter than magnitude 12.5. M37 has at least a dozen red giants and its hottest surviving main sequence star is of stellar classification B9 V. The abundance of elements other than hydrogen and helium, what astronomers term metallicity, is similar to, if not slightly higher than, the abundance in the Sun.At its estimated distance of around 4,500 light-years (1,400 parsecs) from Earth, the cluster's angular diameter of 24 arcminutes corresponds to a physical extent of about 20–25 ly (6.1–7.7 pc). The tidal radius of the cluster, where external gravitational perturbations begin to have a significant influence on the orbits of its member stars, is about 46–59 ly (14–18 pc). This cluster is following an orbit through the Milky Way with a period of 219.3 Ma and an eccentricity of 0.22. This will bring it as close as 19.6 kly (6.0 kpc) to, and as distant as 30.7 kly (9.4 kpc) from, the Galactic Center. It reaches a peak distance above the galactic plane of 0.29 kly (0.089 kpc) and will cross the plane with a period of 31.7 Ma."
    },

    "m38": {
        "to": "Messier 38",
        "title": "Messier 38",
        "extract": "Messier 38 or M38, also known as NGC 1912, is an open cluster of stars in the constellation of Auriga. It was discovered by Giovanni Batista Hodierna before 1654 and independently found by Le Gentil in 1749. Open cluster M36 and M37, also discovered by Hodierna, and often grouped together with M38. Distance is about 1.066 kpc (3,480 ly) away from Earth. The open cluster NGC 1907 lies nearby on the sky, but the two are most likely just experiencing a fly-by, having originated in different parts of the galaxy.The cluster's brightest stars form a pattern resembling the Greek letter Pi or, according to Webb, an \"oblique cross\". Walter Scott Houston described its appearance as follows:\n\"Photographs usually show a departure from circularity, a feature quite evident to visual observers.  Older reports almost always mention a cross shape, which seems more pronounced with small instruments.  A view with a 24-inch reflector on a fine Arizona night showed the cluster as irregular, and the host of stars made fruitless any effort to find a geometrical figure.\"\nAt its distance of 1066 pc., its angular diameter of about 20 arc minutes corresponds to about 4.0 parsecs (13 light years), similar to that of its more distant neighbor M37. It is of intermediate age at about 290 million years. From the population of about 100 stars, this open cluster  features a prominent yellow giant with the apparent magnitude +7.9 and spectral type G0 as its brightest member. This corresponds to an absolute magnitude of -1.5, or a luminosity of 900 Suns. For comparison, the Sun would appear as a faint magnitude +15.3 star from the distance of M38."
    },

    "m39": {
        "to": "Messier 39",
        "title": "Messier 39",
        "extract": "Messier 39 or M39, also known as NGC 7092, is an open cluster of stars in the constellation of Cygnus, positioned two degrees to the south of the star Pi Cygni and around 9° east-northeast of Deneb. The cluster was discovered by Guillaume Le Gentil in 1749, then Charles Messier added it to his catalogue in 1764. When observed in a small telescope at low power the cluster shows around two dozen members, but it is best observed with binoculars. It has a total integrated magnitude (brightness) of 5.5 and spans an angular diameter of 29 arcminutes – about the size of the full Moon. M39 is at a distance of about 1,010 light-years (311 parsecs) from the Sun.\nThis cluster has an estimated mass of 232 M☉ and a linear tidal radius of 8.6±1.8 pc. Of the 15 brightest components, six form binary star systems with one more suspected. HD 205117 is a probable eclipsing binary system with a period of 113.2 days that varies by 0.051 in visual magnitude. Both members appear to be subgiant stars. There are at least five chemically peculiar stars in the cluster and ten suspected short-period variable stars."
    },

    "m40": {
        "to": "Messier 40",
        "title": "Winnecke 4",
        "extract": "Winnecke 4 (also known as Messier 40 or WNC 4) is a double star consisting of two unrelated stars in the constellation Ursa Major.\nWNC 4 was discovered by Charles Messier in 1764 while he was searching for a nebula that had been reported in the area by Johannes Hevelius.  Not seeing any nebulae, Messier catalogued this double star instead.  It was subsequently rediscovered by Friedrich August Theodor Winnecke in 1863, and included in the Winnecke Catalogue of Double Stars as number 4.  Burnham calls M40 \"one of the few real mistakes in the Messier catalog,\" faulting Messier for including it when all he saw was a double star, not a nebula of any sort.In 1991 the separation between the components was measured at 51.7\", an increase since Messier's time.  Data gathered by astronomers Brian Skiff (2001) and Richard L. Nugent (2002) strongly suggested that this was merely an optical double star rather than a physically connected system.  In 2016, parallax measurements from the Gaia satellite showed that the two stars involved (HD 238107 and HD 238108) are unrelated, confirming the previous suggestion by Skiff and Nugent.  As measured by Gaia, the two stars are 350±30 pc and 140±5 pc distant, so one is over twice as far as the other."
    },

    "m41": {
        "to": "Messier 41",
        "title": "Messier 41",
        "extract": "Messier 41 (also known as M41 or NGC 2287) is an open cluster in the constellation Canis Major. It was discovered by Giovanni Batista Hodierna before 1654 and was perhaps known to Aristotle about 325 BC. M41 lies about four degrees almost exactly south of Sirius, and forms a triangle with it and Nu2 Canis Majoris—all three can be seen in the same field in binoculars. The cluster itself covers an area around the size of the full moon. It contains about 100 stars including several red giants, the brightest being a spectral type K3 giant of apparent magnitude 6.3 near the cluster's center, and a number of white dwarfs. The cluster is estimated to be moving away from us at 23.3 km/s.  The diameter of the cluster is between 25 and 26 light years.  It is estimated to be 190 million years old, and cluster properties and dynamics suggest a total life expectancy of 500 million years for this cluster, before it will have disintegrated.Walter Scott Houston describes the appearance of the cluster in small telescopes:\n\nMany visual observers speak of seeing curved lines of stars in M41.  Although they seem inconspicuous on photographs, the curves stand out strongly in my 10-inch [reflecting telescope], and the bright red star near the center of the cluster is prominent."
    },

    "m42": {
        "to": "Messier 42",
        "title": "Orion Nebula",
        "extract": "The Orion Nebula (also known as Messier 42, M42, or NGC 1976) is a diffuse nebula situated in the Milky Way, being south of Orion's Belt in the constellation of Orion. It is one of the brightest nebulae, and is visible to the naked eye in the night sky. M42 is located at a distance of 1,344 ± 20 light years and is the closest region of massive star formation to Earth. The M42 nebula is estimated to be 24 light years across. It has a mass of about 2,000 times that of the Sun. Older texts frequently refer to the Orion Nebula as the Great Nebula in Orion or the Great Orion Nebula.The Orion Nebula is one of the most scrutinized and photographed objects in the night sky, and is among the most intensely studied celestial features. The nebula has revealed much about the process of how stars and planetary systems are formed from collapsing clouds of gas and dust. Astronomers have directly observed protoplanetary disks, brown dwarfs, intense and turbulent motions of the gas, and the photo-ionizing effects of massive nearby stars in the nebula."
    },

    "m43": {
        "to": "Messier 43",
        "title": "Messier 43",
        "extract": "Messier 43 or M43, also known as De Mairan's Nebula and NGC 1982, is a star-forming nebula with a prominent H II region in the equatorial constellation of Orion. It was discovered by the French scientist Jean-Jacques Dortous de Mairan some time before 1731, then catalogued by French astronomer Charles Messier on March 4, 1769. The De Mairan's Nebula is part of the Orion Nebula (Messier 42), being separated from the main nebula by a dense lane of dust known as the northeast dark lane. It is part of the much larger Orion Molecular Cloud Complex.\nThe main ionizing star in this nebula is HD 37061 (variable star designation NU Ori), which is positioned near the center of the H II region and located 1,300 ± 160 ly (400 ± 50 pc) from the Sun. This is a triple star system with the brighter component being a single-lined spectroscopic binary. The main component is a blue-white hued B-type main-sequence star with a stellar classification of B0.5V or B1V. It has 19±7 times the mass of the Sun and 5.7±0.8 times the Sun's radius. The star is radiating over 26,000 times the Sun's luminosity from its photosphere at an effective temperature of 31,000 K. It is spinning rapidly with a projected rotational velocity of around 200 km/s.The H II region is a roundish volume of ionized hydrogen centered on HD 37061. It has a diameter of about 4.5′, corresponding to a linear size of 2.1 ly (0.65 pc). The net hydrogen alpha luminosity of this region is (3.0±1.1)×1035 erg s−1; equivalent to 78 L☉. There is a dark lane crossing in front of the region from north to south, known as the M43 dark lane."
    },

    "m44": {
        "to": "Messier 44",
        "title": "Beehive Cluster",
        "extract": "The Beehive Cluster (also known as Praesepe (Latin for \"manger\"), M44, NGC 2632, or Cr 189), is an open cluster in the constellation Cancer. It is one of the nearest open clusters to Earth, containing a larger population of stars than other nearby bright open clusters. Under dark skies, the Beehive Cluster looks like a small nebulous object to the naked eye; as known since ancient times. Classical astronomer Ptolemy described it as \"nebulous mass in the breast of Cancer\", and it was among the first objects that Galileo studied with his\ntelescope.Age and proper motion coincide with those of the Hyades, suggesting they may share similar origins. Both clusters also contain red giants and white dwarfs, which represent later stages of stellar evolution, along with many main sequence stars.\nDistance to M44 is often cited to be between 160 and 187 parsecs (520–610 light years)., but the revised Hipparcos parallaxes (2009) for Praesepe members and the latest infrared color-magnitude diagram favors an analogous distance of 182 pc. There are better age estimates of around 600 million years, equivalent to about 625 million years, for the Hyades. The diameter of the bright inner cluster core is about 7.0 parsecs (23 light years).Observationally, the Beehive is easily visible to the naked eye as a small nebulous cloud when Cancer culminates in the early evening sky each year from February to May. At 1.5° across, the cluster easily fits within the field of view of binoculars or low-powered small telescopes."
    },

    "m45": {
        "to": "Messier 45",
        "title": "Pleiades",
        "extract": "The Pleiades (), also known as the Seven Sisters and Messier 45, are an open star cluster containing middle-aged, hot B-type stars located in the constellation of Taurus. It is among the nearest star clusters to Earth and is the cluster most obvious to the naked eye in the night sky.\nThe cluster is dominated by hot blue and luminous stars that have formed within the last 100 million years. Reflection nebulae around the brightest stars were once thought to be left over material from the formation of the cluster, but are now considered likely to be an unrelated dust cloud in the interstellar medium through which the stars are currently passing.Computer simulations have shown that the Pleiades were probably formed from a compact configuration that resembled the Orion Nebula. Astronomers estimate that the cluster will survive for about another 250 million years, after which it will disperse due to gravitational interactions with its galactic neighborhood."
    },

    "m46": {
        "to": "Messier 46",
        "title": "Messier 46",
        "extract": "Messier 46 or M46, also known as NGC 2437, is an open cluster of stars in the constellation of Puppis. It was discovered by Charles Messier in 1771.  Dreyer described it as \"very bright, very rich, very large.\" M46 is about 4,920 light-years away. There are an estimated 500 stars in the cluster with a combined mass of 453 M☉, and it is thought to be some 251.2 million years old.The cluster has a tidal radius of 37.8 ± 4.6 ly (11.6 ± 1.4 pc) and a core radius of 8.5 ± 1.3 ly (2.6 ± 0.4 pc). It has a greater spatial extend in the infrared than in visible light, suggesting that the cluster is undergoing some mass segregation with the fainter (redder) stars migrating to a coma region. The fainter stars that extend out to the south and west may form a tidal tail due to a past interaction.The planetary nebula NGC 2438 appears to lie within the cluster near its northern edge (the faint smudge at the top center of the image), but it is most likely unrelated since it does not share the cluster's radial velocity. It is an example of a superimposed pair possibly similar to that of NGC 2818.\nOn the other hand, the illuminating star of the bipolar Calabash Nebula shares the radial velocity and proper motion of Messier 46, and is at the same distance, so is a bona fide member of the open cluster.M46 is located close by to another open cluster, Messier 47. M46 is about a degree east of M47 in the sky, so the two fit well in a binocular or wide-angle telescope field.\n\n"
    },

    "m47": {
        "to": "Messier 47",
        "title": "Messier 47",
        "extract": "Messier 47 (M47 or NGC 2422) is an open cluster in the constellation Puppis. It was discovered by Giovanni Batista Hodierna before 1654 and independently discovered by Charles Messier on February 19, 1771. It was later independently discovered again, under the current name NGC 2422.\nThere is actually no cluster in the position indicated by Messier, which he expressed in terms of its right ascension and declination with respect to the star 2 Puppis.  However, if the signs of Messier's coordinate differences are changed, the position matches that of NGC 2422. Until the equivalency of M47 with NGC 2422 was found, M47 was considered a lost Messier Object. The discovery that M47 and NGC 2422 were the same cluster only came in 1959 with a realization by Canadian astronomer T. F. Morris.M47 is at a distance of about 1,600 light-years from Earth with an estimated age of about 78 million years. The member stars of M47 have been measured down to about red dwarfs at apparent magnitude 19.  There are around 500 members, the brightest being HD 60855, a magnitude 5.7 Be star. The cluster is dominated by hot class B main sequence and giant stars, but a noticeable colour contrast comes from several bright red giants.M47 is located about a degree away from Messier 46, which is much older and much further away."
    },

    "m48": {
        "to": "Messier 48",
        "title": "Messier 48",
        "extract": "Messier 48 or M48, also known as NGC 2548, is an open cluster of stars in the constellation of Hydra. It was discovered by Charles Messier in 1771. There is no cluster in the position indicated by Messier. The value that he gave for the right ascension matches that of NGC 2548, however, his declination is off by five degrees. Credit for discovery is sometimes given instead to Caroline Herschel in 1783. Her nephew John Herschel described it as, \"a superb cluster which fills the whole field; stars of 9th and 10th to the 13th magnitude – and none below, but the whole ground of the sky on which it stands is singularly dotted over with infinitely minute points\". The brightest component is HIP 40348 at visual magnitude 8.3.M48 is visible to the naked eye under good atmospheric conditions. It is located some 2,500 light-years from the Sun. The age estimated from isochrones is 400±100 Myr, while gyrochronology age estimate is 450±50 Myr – in good agreement. The cluster has a tidal radius of 63.3 ± 7.8 ly (19.4 ± 2.4 pc) with at least 438 members and a mass of 2,366 M☉. The general structure of the cluster is fragmented and lumpy, which may be due to interactions with the galactic disk. The cluster is now subdivided into three groups, each of which has its own collective proper motion.\n\n"
    },

    "m49": {
        "to": "Messier 49",
        "title": "Messier 49",
        "extract": "Messier 49 (also known as M 49 or NGC 4472) is an elliptical galaxy located about 56 million light-years away in the equatorial constellation of Virgo. This galaxy was discovered by French astronomer Charles Messier on February 16, 1777. \nAs an elliptical galaxy, Messier 49 has the physical form of a radio galaxy, but it only has the radio emission of a normal galaxy. From the detected radio emission, the core region has roughly 1053 erg (1046 J or 1022 YJ) of synchrotron energy. The nucleus of this galaxy is emitting X-rays, suggesting the likely presence of a supermassive black hole with an estimated mass of 5.65 × 108 solar masses, or 565 million times the mass of the Sun. X-ray emissions shows a structure to the north of Messier 49 that resembles a bow shock. To the southwest of the core, the luminous outline of the galaxy can be traced out to a distance of 260 kpc. The only supernova event observed within this galaxy is SN 1969Q, discovered in June 1969.This galaxy has a large collection of globular clusters, estimated at about 5,900. However, this count is far exceeded by the 13,450 globular clusters orbiting the supergiant elliptical galaxy Messier 87. On average, the globular clusters of M 49 are about 10 billion years old. Between 2000 and 2009, strong evidence for a stellar mass black hole was discovered in an M 49 cluster. A second candidate was announced in 2011.Messier 49 was the first member of the Virgo Cluster of galaxies to be discovered. It is the most luminous member of that cluster and more luminous than any galaxy closer to the Earth. This galaxy forms part of the smaller Virgo B subcluster located 4.5° away from the dynamic center of the Virgo Cluster, centered on Messier 87. Messier 49 is gravitationally interacting with the dwarf irregular galaxy UGC 7636. The dwarf shows a trail of debris spanning roughly 1 × 5 arcminutes, which corresponds to a physical dimension of 6 × 30 kpc."
    },

    "m50": {
        "to": "Messier 50",
        "title": "Messier 50",
        "extract": "Messier 50 or M 50, also known as NGC 2323, is an open cluster of stars in the constellation Monoceros. It was recorded by G. D. Cassini before 1711 and independently discovered by Charles Messier on April 5, 1772 while observing Biela's Comet. It is sometimes described as a 'heart-shaped' figure or a blunt arrowhead.M50 is at a distance of about 3,000 light-years away from Earth and is located near the edge of the CMa OB1 association. It has a core radius of 5.9 ly (1.8 pc) and spans 17.8 ly (5.46 pc). The cluster has a 508 confirmed members with a combined mass of more than 285 M☉, for a stellar density of 1.3 stars per cubic parsec. It is around 140 million years old, with two high-mass white dwarfs and two chemically peculiar stars.\n\n"
    },

    "m51": {
        "to": "Messier 51",
        "title": "Whirlpool Galaxy",
        "extract": "The Whirlpool Galaxy, also known as Messier 51a, M51a, and NGC 5194, is an interacting grand-design spiral galaxy with a Seyfert 2 active galactic nucleus. It lies in the constellation Canes Venatici, and was the first galaxy to be classified as a spiral galaxy. Its distance is estimated to be 23 million light-years away from Earth.\nThe galaxy and its companion, NGC 5195, are easily observed by amateur astronomers, and the two galaxies may be seen with binoculars. The Whirlpool Galaxy has been extensively observed by professional astronomers, who study it to understand galaxy structure (particularly structure associated with the spiral arms) and galaxy interactions."
    },

    "m52": {
        "to": "Messier 52",
        "title": "Messier 52",
        "extract": "Messier 52 or M52, also known as NGC 7654, is an open cluster of stars in the northern constellation of Cassiopeia. It was discovered by Charles Messier on September 7, 1774. M52 can be seen from Earth with binoculars. The brightness of the cluster is influenced by extinction, which is stronger in the southern half.R. J. Trumpler classified the cluster appearance as II2r, indicating a rich cluster with little central concentration and a medium range in the brightness of the stars. This was later revised to I2r, denoting a dense core. The cluster has a core radius of 2.97 ± 0.46 ly (0.91 ± 0.14 pc) and a tidal radius of 42.7 ± 7.2 ly (13.1 ± 2.2 pc). It has an estimated age of 158.5 million years and a mass of 1,200 M☉.The magnitude 8.3 supergiant star BD +60°2532 is a probable member of M52. The stellar population includes 18 candidate slowly pulsating B stars, one of which is a δ Scuti variable, and three candidate γ Dor variables. There may also be three Be stars. The core of the cluster shows a lack of interstellar matter, which may be the result of supernovae explosions early in the cluster's history."
    },

    "m53": {
        "to": "Messier 53",
        "title": "Messier 53",
        "extract": "Messier 53 (also known as M53 or NGC 5024) is a globular cluster in the Coma Berenices constellation. It was discovered by Johann Elert Bode in 1775. M53 is one of the more outlying globular clusters, being about 60,000 light-years (18.4 kpc) light-years away from the Galactic Center, and almost the same distance (about 58,000 light-years (17.9 kpc)) from the Solar system. The cluster has a core radius (rc) of 2.18 pc, a half-light radius (rh) of  5.84 pc, and a tidal radius (rtr) of 239.9 pc.This is considered a metal-poor cluster and at one time was thought to be the most metal-poor cluster in the Milky Way. Abundance measurements of cluster members on the red giant branch show that most are first-generation stars. That is, they did not form from gas recycled from previous generations of stars. This differs from the majority of globular clusters that are more dominated by second generation stars. The second generation stars in NGC 5024 tend to be more concentrated in the core region. Overall, the stellar composition of cluster members is similar to members of the Milky Way halo.The cluster displays various tidal-like features including clumps and ripples around the cluster, and tails along the cluster's orbit in an east-west direction. A tidal bridge-like structure appears to connect M53 with the close, very diffuse neighbor NGC 5053, as well as an envelope surrounding both clusters. These may indicate a dynamic tidal interaction has occurred between the two clusters; a possibly unique occurrence within the Milky Way since there are no known binary clusters within the galaxy. In addition, M53 is a candidate member of the Sagittarius dwarf galaxy tidal stream.Among the variable star population in the cluster, there are 55 known to be RR Lyrae variables. Of these, a majority of 34 display behavior typical of the Blazhko effect, including 23 of type RRc – the largest known population of the latter in any globular cluster. There are also at least three variables of type SX Phe and a semi-regular red giant."
    },

    "m54": {
        "to": "Messier 54",
        "title": "Messier 54",
        "extract": "Messier 54 (also known as M54 or NGC 6715) is a globular cluster in the constellation Sagittarius. It was discovered by Charles Messier in 1778 and subsequently included in his catalog of comet-like objects. \nM54 is easily found in the sky, being close to the star ζ Sagittarii. It is, however, not resolvable into individual stars even with larger amateur telescopes."
    },

    "m55": {
        "to": "Messier 55",
        "title": "Messier 55",
        "extract": "Messier 55 (also known as M55 or NGC 6809) is a globular cluster in the constellation Sagittarius. It was discovered by Nicolas Louis de Lacaille in June 16, 1752 while observing from what today is South Africa. Starting in 1754, Charles Messier made several attempts to find this object from Paris, France, but the low declination meant it never rose sufficiently far above the horizon to allow for easy observation. He finally observed and catalogued it in 1778. The cluster can be seen with a pair of 50 mm binoculars, although resolving the individual stars requires a medium-sized telescope.M55 is at a distance of about 17,600 light-years away from Earth. It has a mass of about 269,000 times that of the Sun. As with other Milky Way globular clusters, it has a low abundance of elements other than hydrogen and helium compared to the Sun—what astronomers term the metallicity of the cluster. This quantity is normally listed as the base–10 logarithm of the proportion relative to the Sun; for NGC 6809 the metallicity is given by: [Fe/H] = –1.94 dex. Taking this exponent to the powers of 10 yields an abundance equal to 1.1% of the proportion of such elements in the Sun.\nOnly about 55 variable stars have been discovered in the central part of M55.\n\n"
    },

    "m56": {
        "to": "Messier 56",
        "title": "Messier 56",
        "extract": "Messier 56 (also known as M56 or NGC 6779) is a globular cluster in the constellation Lyra. It was discovered by Charles Messier on January 19, 1779. The cluster is located almost midway along an imaginary line between Albireo (β Cygni) and Sulafat (γ Lyrae). It is a challenge to find with large (50–80 mm) binoculars, appearing as a slightly fuzzy star. The cluster can be resolved using a telescope with an aperture of 8 in (20 cm) or larger.M56 is at a distance of about 32,900 light-years from Earth and measures roughly 84 light-years across, with a combined mass some 230,000 times that of the Sun. It is about 31–32 kly (9.5–9.8 kpc) from the Galactic Center and 4.8 kly (1.5 kpc) above the galactic plane. This cluster has an estimated age of 13.70 billion years and is following a retrograde orbit through the Milky Way. The properties of this cluster suggest that it may have been acquired during the merger of a dwarf galaxy, of which Omega Centauri forms the surviving nucleus. For Messier 56, the abundance of elements other than hydrogen and helium, what astronomers term the metallicity, has a very low value of [Fe/H] = –2.00 dex. This is equivalent to 1% of the abundance in the Sun.The brightest stars in M56 are of 13th magnitude, while it contains only about a dozen known variable stars, such as V6 (RV Tauri star; period: 90 days) or V1 (Cepheid: 1.510 days); other variable stars are V2 (irregular) and V3 (semiregular). In 2000, a diffuse X-ray emission was tentatively identified coming from the vicinity of the cluster. This is most likely interstellar medium that has been heated by the passage of the cluster through the galactic halo. The relative velocity of the cluster is about 177 km s−1, which is sufficient to heat the medium in its wake to a temperature of 940,000 K.M56 is part of the Gaia Sausage, the hypothesised remains of a merged dwarf galaxy.\n\n"
    },

    "m57": {
        "to": "Messier 57",
        "title": "Ring Nebula",
        "extract": "The Ring Nebula (also catalogued as Messier 57, M57 or NGC 6720) is a planetary nebula in the northern constellation of Lyra. Such objects are formed when a shell of ionized gas is expelled into the surrounding interstellar medium by a star at in the last stages of its evolution before becoming a white dwarf."
    },

    "m58": {
        "to": "Messier 58",
        "title": "Messier 58",
        "extract": "Messier 58 (also known as M58 and NGC 4579) is an intermediate barred spiral galaxy with a weak inner ring structure located within the constellation Virgo, approximately 68 million light-years away  from Earth. It was discovered by Charles Messier on April 15, 1779 and is one of four barred spiral galaxies that appear in Messier's catalogue. M58 is one of the brightest galaxies in the Virgo Cluster. From 1779 it was arguably (though unknown at that time) the farthest known astronomical object  until the release of the New General Catalogue in the 1880s and even more so the publishing of redshift values in the 1920s.\n\n"
    },

    "m59": {
        "to": "Messier 59",
        "title": "Messier 59",
        "extract": "Messier 59 or M59, also known as NGC 4621, is an elliptical galaxy in the equatorial constellation of Virgo. M59 is a member of the Virgo Cluster, with the nearest component being separated from M59 by 8′ and around 5 magnitudes fainter. The nearest cluster member of comparable brightness is the lenticular galaxy NGC 4638, which is around 17′ away. Messier 59 and the nearby elliptical galaxy Messier 60 were both discovered by Johann Gottfried Koehler in April 1779 during observations of a comet in the same part of the sky. Charles Messier listed both in the Messier Catalogue about three days after Koehler's discovery.This is an elliptical galaxy of type E5 with a position angle of 163.3°, indicating the overall shape shows a flattening of 50%. However, isophotes for this galaxy deviate from a perfect ellipticity, showing pointed shapes instead. These can be decomposed mathematically into a three component model, with each part having a different eccentricity. The main elliptical component appears to be superimposed upon a flatter, disk-like feature, with the entirety embedded within a circular halo. The luminosity contribution of the components is 62% for the pure elliptical part, 22% for the halo, and the remainder coming from the disk. The light ratio of the disk to the main elliptical body is 0.25, whereas it is typically closer to 0.5 in a lenticular galaxy.The core contains a supermassive black hole (SMBH), with a mass that has been estimated to be 270 million times the mass of the Sun, and counter-rotates with respect of the rest of the galaxy, being bluer. The SMBH is quiescent, but is detectable as an X-ray and radio source that indicates an outflow. The nucleus contains an embedded stellar disk that is bluer (younger) than the bulge region, with a blue component stretching along a position angle of around 150°. This extended disk feature may be the result of a galactic merger followed by a starburst event.Messier 59 is very rich in globular clusters, with a population of them that has been estimated to be around 2,200. It has a satellite, the Ultra Compact Dwarf galaxy M59-UCD3.One supernova (1939B) has been recorded in M59; it reached a peak magnitude of 11.9. The region where this supernova occurred shows no trace of star formation, which suggests this was a type Ia supernova.\n\n"
    },

    "m60": {
        "to": "Messier 60",
        "title": "Messier 60",
        "extract": "Messier 60 or M60, also known as NGC 4649, is an elliptical galaxy approximately 57 million light-years away in the equatorial constellation of Virgo. Together with NGC 4647, it forms a pair known as Arp 116. Messier 60 and the nearby spiral galaxy Messier 59 were both discovered by Johann Gottfried Koehler in April 1779 during observations of a comet in the same part of the sky. Charles Messier added both to his catalogue about three days after Koehler's discovery.\n\n"
    },

    "m61": {
        "to": "Messier 61",
        "title": "Messier 61",
        "extract": "Messier 61 (also known as M61 or NGC 4303) is an intermediate barred spiral galaxy in the Virgo Cluster of galaxies. It was discovered by Barnaba Oriani on May 5, 1779. This was six days before Charles Messier observed the same galaxy, but had mistaken it as a comet."
    },

    "m62": {
        "to": "Messier 62",
        "title": "Messier 62",
        "extract": "Messier 62 or M62, also known as NGC 6266, is a globular cluster of stars in the equatorial constellation of Ophiuchus. It was discovered on June 7, 1771 by Charles Messier, then added to his catalogue in 1779.M62 is at a distance of about 22.2 kly from Earth and 5.5 kly from the Galactic center. It is among the ten most massive and luminous globular clusters in the Milky Way, showing an integrated absolute magnitude of –9.18. The cluster has an estimated mass of 1.22×106 M☉ and a mass-to-light ratio of 2.05±0.04 in the V band. It has a projected ellipticity of 0.01, meaning is it essentially spherical. The density profile of the cluster members suggests it has not yet undergone core collapse. It has a core radius of 1.3 ly (0.39 pc), a half-mass radius of 9.6 ly (2.95 pc), and a half-light radius of 6.0 ly (1.83 pc). The stellar density at the core is 5.13 M☉ per cubic parsec. It has a tidal radius of 59 ly (18.0 pc).The cluster shows at least two distinct populations of stars, which most likely represent two separate episodes of star formation. Of the main sequence stars in the cluster, 79%±1% are from the first generation and 21%±1% from the second. The second generation is polluted by materials released by the first. In particular, the abundances of helium, carbon, magnesium, aluminium, and sodium differ between the two populations.Indications are this is an Oosterhoff type I, or \"metal-rich\" system. A 2010 study identified 245 variable stars in the cluster's field, of which 209 are RR Lyrae variables, four are Type II Cepheids, 25 are long period variables, and one is an eclipsing binary. The cluster may prove to be the galaxy's richest in terms of RR Lyrae variables. It has six binary millisecond pulsars, including one (COM6266B) that is displaying eclipsing behavior from gas streaming off its companion. There are multiple X-ray sources, including 50 within the half-mass radius. 47 blue straggler candidates have been identified, formed from the merger of two stars in a binary system, and these are preferentially concentrated near the core region.It is hypothesized that this cluster may be host to an intermediate mass black hole (IMBH), and it is considered particularly suitable for searching for such an object. Examination of the proper motion of stars within 17″ of the core does not require an IMBH to explain. However, simulations can not rule out an IMBH with a mass of a few thousand M☉. Based upon radial velocity measurements within an arcsecond of the core, Kiselev et al. (2008) made the claim that there is an IMBH with a mass in the range (1–9)×103 M☉.\n\n"
    },

    "m63": {
        "to": "Messier 63",
        "title": "Messier 63",
        "extract": "Messier 63 or M63, also known as NGC 5055 or the seldom-used Sunflower Galaxy, is a spiral galaxy in the northern constellation of Canes Venatici. M63 was first discovered by the French astronomer Pierre Méchain then later verified by his colleague Charles Messier on June 14, 1779. The galaxy became listed as object 63 in the Messier Catalogue. In the mid-19th century, Anglo-Irish astronomer Lord Rosse identified spiral structures within the galaxy, making this one of the first galaxies in which such structure was identified.This galaxy has a morphological classification of SAbc, indicating a spiral shape with no central bar feature and moderate to loosely wound arms. There is a general lack of large scale continuous spiral structure in visible light, a galaxy form known as flocculent. However, when observed in the near infrared a symmetric, two-arm structure becomes apparent. Each arm wraps 150° around the galaxy and extends out to 13,000 light-years (4,000 parsecs) from the nucleus.M63 is an active galaxy with a LINER nucleus. This displays as an unresolved nuclear source wrapped in a diffuse emission. The latter is extended along a position angle of 110° and soft X-rays and H-alpha emission can be observed coming from along nearly the same direction. The existence of a super massive black hole (SMBH) at the nucleus is uncertain; if it does exist, then the mass is estimated as (8.5±1.9)×108 M☉.Radio observations at 21-cm show the gaseous disk of M63 extending outward to a radius of 130,000 light-years (40 kiloparsecs), well past the bright optical disk. This gas shows a symmetrical form that is warped in a pronounced manner, starting at a radius of 33,000 light-years (10 kiloparsecs). The form suggests the dark matter halo of the galaxy is offset with respect to the inner region. The reason for the warp is unclear, but the position angle points toward the smaller companion galaxy, UGC 8313.The distance to M63, based upon the luminosity-distance measurement is 29,300,000 light-years (8.99 megaparsecs). The radial velocity relative to the Local Group yields an estimate of 15,200,000 light-years (4.65 megaparsecs). Estimates based on the Tully-Fisher relation range over 16,000,000–34,000,000 light-years (5.0–10.3 megaparsecs). The tip of the red-giant branch technique gives a distance of 28,930,000 ± 950,000 light-years (8.87 ± 0.29 megaparsecs). M63 is part of the M51 Group, a group of galaxies that also includes M51 (the 'Whirlpool Galaxy').In 1971, a supernova with a magnitude of 11.8 appeared in one of the arms of M63. It was discovered May 24, 1971 and reached peak light around May 26. The spectrum of SN 1971 I is consistent with a supernova of type I. However, the spectroscopic behavior appeared anomalous."
    },

    "m64": {
        "to": "Messier 64",
        "title": "Black Eye Galaxy",
        "extract": "The Black Eye Galaxy (also called Evil Eye Galaxy and designated Messier 64, M64, or NGC 4826) is a relatively isolated spiral galaxy located 17 million light years away in the northern constellation of Coma Berenices. It was discovered by Edward Pigott in March 1779, and independently by Johann Elert Bode in April of the same year, as well as by Charles Messier in 1780. A dark band of absorbing dust in front of the galaxy's bright nucleus gave rise to its nicknames of the \"Black Eye\" or \"Evil Eye\" galaxy. M64 is well known among amateur astronomers because of its appearance in small telescopes.\nThis galaxy is inclined 60° to the line-of-sight and has a position angle of 112°. At the distance of this galaxy, it has a linear scale of 65 ly (20 pc) per arcsecond. The morphological classification of NGC 4826 in the De Vaucouleurs system is (R)SA(rs)ab, where the '(R)' indicates an outer ring-like structure, 'SA' denotes a non-barred spiral, '(rs)' means a transitional inner ring/spiral structure, and 'ab' says the spiral arms are fairly tightly wound. Ann et al. (2015) gave it a class of SABa, suggesting a weakly-barred spiral galaxy with tightly wound arms.\nM64 is a type 2 Seyfert galaxy with an HII/LINER nucleus. The central region is a weak source of radio emission. A soft X-ray source has been detected at the nucleus, which is most likely coming from the circumnuclear region rather than directly from an active galactic nucleus. There is an inner disk of molecular gas that is truncated at a radius of 2,300 ly (700 pc). At present, the non-rotational motions of this disk do not significantly feed the core, but the disk does produce a vigorous rate of star formation. There is also evidence of a recent large inflow of mass.The interstellar medium of Messier 64 consists of two counter-rotating disks that are approximately equal in mass. The inner disk contains the prominent dust lanes of the galaxy. The stellar population of the galaxy exhibits no measurable counter-rotation. Possible formation scenarios include a merger with a gas-rich satellite galaxy in a retrograde orbit, or the continued accretion of gas clouds from the intergalactic medium. It has a diameter of 54,000 light-years (17 kpc)."
    },

    "m65": {
        "to": "Messier 65",
        "title": "Messier 65",
        "extract": "Messier 65 (also known as NGC 3623) is an intermediate spiral galaxy about 35 million light-years away in the constellation Leo.  It was discovered by Charles Messier in 1780.  Along with M66 and NGC 3628, M65 forms the Leo Triplet, a small group of galaxies."
    },

    "m66": {
        "to": "Messier 66",
        "title": "Messier 66",
        "extract": "Messier 66 or M66, also known as NGC 3627, is an intermediate spiral galaxy in the equatorial constellation of Leo. It was discovered by French astronomer Charles Messier on March 1, 1780, who described it as \"very long and very faint\". This galaxy is a member of a small group of galaxies that includes M65 and NGC 3628, known as the Leo Triplet, or the M66 Group. M65 and M66 make a popular pair for observers, being separated by only 20′.M66 has a morphological classification of SABb, indicating a spiral shape with a weak bar feature and loosely wound arms. The isophotal axis ratio is 0.32, indicating that it is being viewed at an angle. M66 is receding from us with a heliocentric radial velocity of 696.3±12.7 km/s. It lies 31 million light-years away and is about 95 thousand light-years across with striking dust lanes and bright star clusters along sweeping spiral arms. As of 2018, five supernovae have been observed in M66: SN 2016cok, 2009hd, 1997bs, 1989B, and 1973R.Gravitational interaction from its past encounter with neighboring NGC 3628 has resulted in an extremely high central mass concentration; a high molecular to atomic mass ratio; and a resolved non-rotating clump of H I material apparently removed from one of the spiral arms. The latter feature shows up visually as an extremely prominent and unusual spiral arm and dust lane structures as originally noted in the Atlas of Peculiar Galaxies."
    },

    "m67": {
        "to": "Messier 67",
        "title": "Messier 67",
        "extract": "Messier 67 (also known as M67 or NGC 2682) is an open cluster in the constellation of Cancer.  M67's Trumpler class is variously given as II 2 r, II 2 m, or II 3 r. It was discovered by Johann Gottfried Koehler in 1779. Age estimates for the cluster range between 3.2 and 5 billion years, with the most recent estimate (4 Gyr) implying stars in M67 are younger than the Sun.  Distance estimates are likewise varied and typically range between 800–900 pc. Recent estimates of 855, 840, and 815 pc were established via binary star modelling and infrared color-magnitude diagram fitting, accordingly.\n\nM67 is not the oldest known open cluster, but  Galactic clusters known to be older are few, and none of those is closer than M67.  The latter is an important laboratory for studying stellar evolution, since the cluster is well populated, negligible amounts of dust obscuration, and all its stars are at the same distance and age, except for approximately 30 anomalous blue stragglers, whose origins are not fully understood.\n\nM67 is probably the second best observed open cluster after the Hyades cluster, which is amongst the nearest open clusters and younger than M67. M67 is one of the most-studied open clusters, yet estimates of its physical parameters such as age, mass, and number of stars of a given type, vary substantially.  Richer et al. estimate its age to be 4 billion years, its mass to be 1080 solar masses, and the number of white dwarfs to be 150. Hurley et al. estimate its current mass to be 1400 solar masses and its initial mass to be approximately 10 times as great.\nM67 has more than 100 stars similar to the Sun, and numerous red giants.  The total star count has been estimated at well over 500.  The ages and prevalence of Sun-like stars contained within the cluster had led astronomers to consider M67 as the possible parent cluster of the Sun. However, computer simulations have suggested that this is highly unlikely to be the case.The cluster contains no main sequence stars bluer than spectral type F, other than perhaps some of the blue stragglers, since the brighter stars of that age have already left the main sequence.  In fact, when the stars of the cluster are plotted on the Hertzsprung-Russell diagram, there is a distinct \"turn-off\" representing the stars which have terminated hydrogen fusion in the core and are destined to become red giants.  As the cluster ages, the turn-off moves progressively down the main sequence.\nIt appears that M67 does not contain an unbiased sample of stars.  One cause of this is mass segregation, the process by which lighter stars (actually, systems) gain speed at the expense of more massive stars during close encounters, which causes the lighter stars to be at a greater average distance from the center of the cluster or to escape altogetherA March 2016 joint AIP/JHU study by Barnes at al. on rotational periods of 20 Sun-like stars, measured by the effects of moving starspots on light curves, suggests that these approximately 4 Gyr old stars spin for about 26 days - much like our Sun, which has a period at the equator of 25.38 days. Measurements were carried out as part of the extended K2 mission of Kepler space telescope. This discovery strengthens the solar-stellar connection, a fundamental principle of modern solar and Stellar astrophysics. Sydney Barnes (first author of the study) commented: \"We had predicted this would occur, but it has been a real privilege to have been able to actually make the measurements.\" Co-author Jörg Weingrill adds: \"With the measured rotational periods for stars up to the age of our Sun we can now confidently trace back the evolution of our home star.\""
    },

    "m68": {
        "to": "Messier 68",
        "title": "Messier 68",
        "extract": "Messier 68 (also known as M68 or NGC 4590) is a globular cluster in the equatorial constellation Hydra. It was discovered by Charles Messier in 1780. William Herschel described it as \"a beautiful cluster of stars, extremely rich, and so compressed that most of the stars are blended together\". His son John noted that it was \"all clearly resolved into stars of 12th magnitude, very loose and ragged at the borders\".\n\nM68 is at a distance of about 33,000 light-years away from Earth and is orbiting through the Milky Way with a large eccentricity of 0.5. This orbit carries it as far as 100,000 light years from the galactic center. It is one of the most metal-poor globular clusters, which means it has a paucity of elements other than hydrogen and helium. The cluster may be undergoing core-collapse, and it displays signs of being in rotation. The cluster may have been acquired by the Milky Way galaxy through accretion from a satellite galaxy.All told, as of 2015 a total of 50 variable stars have been identified in this cluster; the first 28 being identified as early as 1919–1920 by American astronomer Harlow Shapley. Most of the variables are of type RR Lyrae, or periodic variables. Six of the variables are of the SX Phoenicis variety, which display short pulsating behavior."
    },

    "m69": {
        "to": "Messier 69",
        "title": "Messier 69",
        "extract": "Messier 69 or M69, also known NGC 6637, is a globular cluster in the southern constellation of Sagittarius. It can be found 2.5° to the northeast of the star Epsilon Sagittarii and is dimly visible in 50 mm aperture binoculars. The cluster was discovered by Charles Messier on August 31, 1780, the same night he discovered M70. At the time, he was searching for an object described by Nicolas-Louis de Lacaille in 1751–2 and thought he had rediscovered it, but it is unclear if Nicolas-Louis de Lacaille actually described M69.This cluster is at a distance of about 28,700 light-years away from Earth and 5,200 ly from the Galactic Center, with a spatial radius of 45 light-years. It is a relatively metal-rich globular cluster that is a likely member of the Galactic bulge population. M69 has a mass of 2.0×105 M☉ with a half-mass radius of 11.6 ly, a core radius of 29.2 ly, and a tidal radius of 91.9 ly. The center of the cluster has a luminosity density of 6,460 L☉·pc−3. It is a close neighbor of globular cluster M70, with perhaps only 1,800 light-years separating the two objects."
    },

    "m70": {
        "to": "Messier 70",
        "title": "Messier 70",
        "extract": "Messier 70 or M70, also known as NGC 6681, is a globular cluster of stars in the southern constellation of Sagittarius. It was discovered by Charles Messier on 31 August 1780. The famous comet Hale–Bopp was discovered near this cluster 23 July 1995.M70 is at a distance of about 29,400 light years away from Earth and around 6,500 light-years from the Galactic Center. It is roughly the same size and luminosity as its neighbour in space, M69. M70 has a very small core radius of 0.22 ly (0.068 pc) and a half-light radius of 182.0 ly (55.80 pc). This cluster has undergone core collapse, leaving it centrally concentrated with the luminosity distribution following a power law.There are two distinct stellar populations in the cluster, with each displaying unique abundance abundances. These likely represent different generations of stars. Five known variable stars lie within the tidal radius of this cluster, all of which are RR Lyrae variables. The cluster may have two blue stragglers near the core."
    },

    "m71": {
        "to": "Messier 71",
        "title": "Messier 71",
        "extract": "Messier 71 (also known as M71 or NGC 6838) is a globular cluster in the constellation Sagitta. It was discovered by Philippe Loys de Chéseaux in 1745 and included by Charles Messier in his catalog of non-comet-like objects in 1780.  It was also noted by Koehler at Dresden around 1775.\nThe star cluster is at a distance of about 12,000 light years away from Earth and spans some 27 light years across. The irregular variable star Z Sagittae is a member of this cluster.\nM71 was long thought (until the 1970s) to be a densely packed open cluster and was classified as such by leading astronomers in the field of star cluster research due to its lacking a dense central compression, and to its stars having more \"metals\" than is usual for an ancient globular cluster; furthermore, it lacks the RR Lyrae \"cluster\" variable stars that are common in most globulars. However, modern photometric photometry has detected a short \"horizontal branch\" in the H-R diagram of M71, which is characteristic of a globular cluster.  The shortness of the branch explains the lacking of the RR Lyrae variables and is due to the globular's relatively young age of 9-10 billion years.  The relative youth of this globular also explains the abundance of \"metals\" in its stars.  Hence today M71 is designated as a very loosely concentrated globular cluster, much like M68 in Hydra. M71 has a luminosity of around 13,200 Suns."
    },

    "m72": {
        "to": "Messier 72",
        "title": "Messier 72",
        "extract": "Messier 72 (also known as M72 or NGC 6981) is a globular cluster in the Aquarius constellation discovered by French astronomer Pierre Méchain on August 29, 1780. French astronomer Charles Messier looked for it on the following October 4, and included it in his catalog. Both decided that it was a faint nebula rather than a cluster. With a larger instrument, British astronomer John Herschel called it a bright \"cluster of stars of a round figure\". American astronomer Harlow Shapley noted a similarity to Messier 4 and Messier 12.This cluster is visible as a faint nebula in a telescope with a 6 cm (2.4 in) aperture. the surrounding field stars become visible at 15 cm (5.9 in), while 25 cm (9.8 in) is sufficient to resolve the cluster with an angular diameter of 2.5′. At 30 cm (12 in) the core is resolved in a 1.25′ diameter, showing a broad spread with darker regions to the south and east.Based upon a 2011 census of variable stars, Messier 72 is located at a distance of 54.57 ± 1.17 kly (16.73 ± 0.36 kpc) from the Sun. It has an estimated combined mass equal to 168,000 times the mass of the Sun and is around 9.5 billion years old. The core region has a density of stars that is radiating 2.26 times the luminosity of the Sun per cubic parsec. There are 43 identified variable stars in the cluster."
    },

    "m73": {
        "to": "Messier 73",
        "title": "Messier 73",
        "extract": "Messier 73 (M73, also known as  NGC 6994) is an asterism of four stars in the constellation of Aquarius.  An asterism is composed of physically unconnected stars that appear close to each other in the sky as seen from Earth."
    },

    "m74": {
        "to": "Messier 74",
        "title": "Messier 74",
        "extract": "Messier 74 (also known as NGC 628 and Phantom Galaxy) is a  spiral galaxy in the constellation Pisces. It is at a distance of about 32 million light-years away from Earth. The galaxy contains two clearly defined spiral arms and is therefore used as an archetypal example of a grand design spiral galaxy.  The galaxy's low surface brightness makes it the most difficult Messier object for amateur astronomers to observe.  However, the relatively large angular size of the galaxy and the galaxy's face-on orientation make it an ideal object for professional astronomers who want to study spiral arm structure and spiral density waves. It is estimated that M74 is home to about 100 billion stars."
    },

    "m75": {
        "to": "Messier 75",
        "title": "Messier 75",
        "extract": "Messier 75 or M75, also known as NGC 6864, is a globular cluster of stars in the southern constellation Sagittarius. It was discovered by Pierre Méchain in 1780 and included in Charles Messier's catalog of comet-like objects that same year.M75 is at a distance of about 67,500 light years away from Earth and is 14,700 light years away from, and on the opposite side of, the Galactic Center. Its apparent size on the sky translates to a true radius of some 67 light years. M75 is classified as class I, meaning it is one of the more densely concentrated globular clusters known. It shows a slow rotation around an axis that is inclined along a position angle of −15°±30°. The absolute magnitude of M75 is about −8.5 or some 180,000 times more luminous than the Sun.The cluster has a half-light radius of 9.1 ly (2.80 pc) with a core radius of about 1.6 ly (0.5 pc) and appears not to have undergone core collapse yet. The mass density at the core is 7.9×104 M☉·pc−3. There are 38 RR Lyrae variable stars and the cluster appears to be Oosterhoff-intermediate in terms of metallicity. 62 candidate blue stragglers have been identified in the cluster field, with 60% being in the core region.Messier 75 is part of the Gaia Sausage, the hypothesized remains of a dwarf galaxy that merged with the Milky Way. It is a halo object with an orbital period of 0.4 Gyr around the galaxy and a large eccentricity of 0.87. The apocenter is 57 kly (17.5 kpc) – close to the current separation."
    },

    "m76": {
        "to": "Messier 76",
        "title": "Little Dumbbell Nebula",
        "extract": "The Little Dumbbell Nebula, also known as Wajih 97, NGC 650/651, the Barbell Nebula, or the Cork Nebula, is a planetary nebula in the constellation Perseus. It was discovered by Pierre Méchain in 1780 and included in Charles Messier's catalog of comet-like objects as number 76. It was first recognised as a planetary nebula in 1918 by the astronomer Heber Doust Curtis. However, there is some contention to this claim, as Isaac Roberts in 1891 did suggest that M76 might be similar to the Ring Nebula (M57), being instead as seen from the side view. The structure is now classed as a bipolar planetary nebula (BPNe).\nDistance to M76 is currently estimated as 780 parsecs or 2,500 light years, making the average dimensions about 0.378 pc. (1.23 ly.) across.The total nebula shines at the apparent magnitude of +10.1 with its central star or planetary nebula nucleus (PNN) at +15.9v (16.1B) magnitude. The UV-light from the PNN is expanding outer layers that form the present nebula, and has the surface temperature of about 88,400 K. The whole planetary nebula is approaching us at 19.1 km/s.The Little Dumbbell Nebula derives its common name from its resemblance to the Dumbbell Nebula (M27) in Vulpecula. It was originally thought to consist of two separate emission nebulae and was thus given two catalog numbers in the NGC 650 and 651. Some consider this object to be one of the faintest and hardest to see objects in Messier's list."
    },

    "m77": {
        "to": "Messier 77",
        "title": "Messier 77",
        "extract": "Messier 77 or M77, also known as NGC 1068, is a barred spiral galaxy about 47 million light-years away in the constellation Cetus. Messier 77 was discovered by Pierre Méchain in 1780, who originally described it as a nebula.  Méchain then communicated his discovery to Charles Messier, who subsequently listed the object in his catalog. Both Messier and William Herschel described this galaxy as a star cluster. Today, however, the object is known to be a galaxy.\nThe morphological classification of NGC 1068 in the De Vaucouleurs system is (R)SA(rs)b, where the '(R)' indicates an outer ring-like structure, 'SA' denotes a non-barred spiral, '(rs)' means a transitional inner ring/spiral structure, and 'b' says the spiral arms are moderately wound. Ann et al. (2015) gave it a class of SAa, suggesting a non-barred spiral galaxy with tightly wound arms. However, infrared images of the inner part of the galaxy reveal a prominent bar feature not seen in visual light, and for this reason it is now considered a barred spiral.Messier 77 is an active galaxy with an Active Galactic Nucleus (AGN), which is obscured from view by astronomical dust at visible wavelengths. The diameter of the molecular disk and hot plasma associated with the obscuring material was first measured at radio wavelengths by the VLBA and VLA. The hot dust around the nucleus was subsequently measured in the mid-infrared by the MIDI instrument at the VLTI. It is the brightest and one of the closest and best-studied type 2 Seyfert galaxies, forming a prototype of this class.X-ray source 1H 0244+001 in Cetus has been identified as Messier 77. Only one supernova has been detected in Messier 77. The supernova, named SN 2018ivc, was discovered on 24 November 2018 by the DLT40 Survey. It is a type II supernova, and at discovery it was 15th magnitude and brightening."
    },

    "m78": {
        "to": "Messier 78",
        "title": "Messier 78",
        "extract": "Messier 78 or M 78, also known as NGC 2068, is a reflection nebula in the constellation Orion. It was discovered by Pierre Méchain in 1780 and included by Charles Messier in his catalog of comet-like objects that same year.M78 is the brightest diffuse reflection nebula of a group of nebulae that includes NGC 2064, NGC 2067 and NGC 2071. This group belongs to the Orion B molecular cloud complex and is about 1,350 light-years distant from Earth. M78 is easily found in small telescopes as a hazy patch and involves two stars of 10th and 11th magnitude. These two B-type stars, HD 38563 A and HD 38563 B, are responsible for making the cloud of dust in M78 visible by reflecting their light.The M78 cloud contains a cluster of stars that is visible in the infrared. Due to gravity, the molecular gas in the nebula has fragmented into a hierarchy of clumps, the denser cores of which about to form stars with masses of up to 5 M☉. About 45 variable stars of the T Tauri type, young stars still in the process of formation as well as some 17 Herbig–Haro objects are known in M78."
    },

    "m79": {
        "to": "Messier 79",
        "title": "Messier 79",
        "extract": "Messier 79 (also known as M79 or NGC 1904) is a globular cluster in the constellation Lepus. It was discovered by Pierre Méchain in 1780 and is at a distance of about 42,000 light years away from Earth and 60,000 light years away from the Galactic Center.\nLike Messier 54 (the other extragalactic globular on Messier's list), it is thought that M79 is not native to the Milky Way galaxy at all, but instead to the putative Canis Major Dwarf Galaxy, which is currently experiencing a very close encounter with the Milky Way. This is, however, a contentious subject as astronomers are still debating the nature of the Canis Major dwarf galaxy itself."
    },

    "m80": {
        "to": "Messier 80",
        "title": "Messier 80",
        "extract": "Messier 80 (also known as M80 or NGC 6093) is a globular cluster in the constellation Scorpius. It was discovered by Charles Messier in 1781.\nThe star cluster is located midway between α Scorpii (Antares) and β Scorpii in a field in the Milky Way that is rich in nebulae. It can be viewed with modest amateur telescopes as a mottled ball of light.  With an apparent diameter of about 10' and at an estimated distance of 32,600 light-years, M80's spatial diameter is about 95 light-years.  It contains several hundred thousand stars, and is among the more densely populated globular clusters in the Milky Way.\nIt contains a relatively large number of blue stragglers, stars that appear to be much younger than the cluster itself. It is thought these stars have lost part of their outer layers due to close encounters with other cluster members or perhaps the result of collisions between stars in the dense cluster. Images from the Hubble Space Telescope have shown districts of very high blue straggler densities, suggesting that the center of the cluster is likely to have a very high capture and collision rate.\nOn May 21, 1860, a nova was discovered in M80 that attained a magnitude of +7.0. The nova, variable star designation T Scorpii, reached an absolute magnitude of −8.5, briefly outshining the entire cluster."
    },

    "m81": {
        "to": "Messier 81",
        "title": "Messier 81",
        "extract": "Messier 81 (also known as NGC 3031 or Bode's Galaxy) is a spiral galaxy about 12 million light-years away, with a diameter of 90,000 light years, about half the size of the Milky Way, in the constellation Ursa Major. Due to its proximity to Earth, large size, and active galactic nucleus (which harbors a 70 million M☉supermassive black hole), Messier 81 has been studied extensively by professional astronomers. The galaxy's large size and relatively high brightness also makes it a popular target for amateur astronomers."
    },

    "m82": {
        "to": "Messier 82",
        "title": "Messier 82",
        "extract": "Messier 82 (also known as NGC 3034, Cigar Galaxy or M82) is a starburst galaxy approximately 12 million light-years away in the constellation Ursa Major. A member of the M81 Group, it is about five times more luminous than the whole Milky Way and has a center one hundred times more luminous than our galaxy's center. The starburst activity is thought to have been triggered by interaction with neighboring galaxy M81.  As the closest starburst galaxy to Earth, M82 is the prototypical example of this galaxy type. SN 2014J, a type Ia supernova, was discovered in the galaxy on 21 January 2014. In 2014, in studying M82, scientists discovered the brightest pulsar yet known, designated M82 X-2."
    },

    "m83": {
        "to": "Messier 83",
        "title": "Messier 83",
        "extract": "Messier 83 or M83, also known as the Southern Pinwheel Galaxy and NGC 5236, is a barred spiral galaxy approximately 15 million light-years away in the constellation Hydra. Nicolas Louis de Lacaille discovered M83 on February 23, 1752 at the Cape of Good Hope. Charles Messier added it to his catalogue of nebulous objects (now known as the Messier Catalogue) in March 1781. This is one of the closest and brightest barred spiral galaxies in the sky, making it visible with binoculars. Its nickname of the Southern Pinwheel derives from its resemblance to the Pinwheel Galaxy (M101)."
    },

    "m84": {
        "to": "Messier 84",
        "title": "Messier 84",
        "extract": "Messier 84 or M84, also known as NGC 4374, is an elliptical or lenticular galaxy in the constellation Virgo. Charles Messier discovered Messier 84 on 18 March 1781 in a systematic search for \"nebulous objects\" in the night sky. The object is the 84th in the Messier Catalogue. M84 is situated in the heavily populated inner core of the Virgo Cluster of galaxies.This is a giant elliptical galaxy with a morphological classification of E1, indicating a flattening of 10%. The half-light radius is 72.5″ and the extinction-corrected total luminosity in the visual band is 7.64×1010 L☉. The central mass-to-light ratio is 6.5, which steadily increases away from the core. The visible galaxy is surrounded by a massive dark matter halo.Radio observations and Hubble Space Telescope  images of M84 have revealed two jets of matter shooting out from the galaxy's center as well as a disk of rapidly rotating gas and stars indicating the presence of a 1.5 ×109 M☉ supermassive black hole. It also has a few young stars and star clusters, indicating star formation at a very low rate. The number of globular clusters is 1,775±150, which is much lower than expected for an elliptical galaxy.Two supernovae have been observed in M84: SN 1957\nand SN 1991bg. Possibly, a third, SN 1980I is part of M84 or, alternatively, one of its neighboring galaxies, NGC 4387 and M86. This high rate of supernova events is rare for elliptical galaxies, which may indicate there is a population of stars of intermediate age in M84."
    },

    "m85": {
        "to": "Messier 85",
        "title": "Messier 85",
        "extract": "Messier 85 (also known as M85 or NGC 4382 or PGC 40515 or ISD 0135852) is a lenticular galaxy, or elliptical galaxy for other authors, in the Coma Berenices constellation. It is 60 million light-years away, and it is estimated to be 125,000 light-years across.\nIt was discovered by Pierre Méchain in 1781. It is the northernmost outlier of the Virgo cluster discovered as of 2004."
    },

    "m86": {
        "to": "Messier 86",
        "title": "Messier 86",
        "extract": "Messier 86 (also known as M86 or NGC 4406) is an elliptical or lenticular galaxy in the constellation Virgo. It was discovered by Charles Messier in 1781. M86 lies in the heart of the Virgo Cluster of galaxies and forms a most conspicuous group with another large galaxy known as Messier 84. It displays the highest blue shift of all Messier objects, as it is approaching the Milky Way at 244 km/s.  This is due to its falling towards the center of the Virgo cluster from the opposite side, which causes it to move in the direction of the Milky Way.Messier 86 is linked by several filaments of ionized gas to the severely disrupted spiral galaxy NGC 4438 and shows some gas and interstellar dust that may have been stripped of it like the one present in those filaments. It is also suffering ram-pressure stripping as it moves at high speed through Virgo's intracluster medium, losing its interstellar medium and leaving behind a very long trail of X ray-emitting hot gas that has been detected with the help of the Chandra space telescope.Messier 86 has a rich system of globular clusters, with a total number of around 3,800. Its halo also has a number of stellar streams interpreted as remnants of dwarf galaxies that have been disrupted and absorbed by this galaxy."
    },

    "m87": {
        "to": "Messier 87",
        "title": "Messier 87",
        "extract": "Messier 87 (also known as Virgo A or NGC 4486, generally abbreviated to M87) is a supergiant elliptical galaxy in the constellation Virgo. One of the most massive galaxies in the observable universe, it has a large population of globular clusters—about 12,000 compared with the 150–200 orbiting the Milky Way—and a jet of energetic plasma that originates at the core and extends at least 1,500 parsecs (4,900 light-years), traveling at relativistic speed. It is one of the brightest radio sources in the sky and a popular target for both amateur and professional astronomers.\nThe French astronomer Charles Messier discovered M87 in 1781, and cataloged it as a nebula. M87 is about 16.4 million parsecs (53 million light-years) from Earth and is the second-brightest galaxy within the northern Virgo Cluster, having many satellite galaxies. Unlike a disk-shaped spiral galaxy, M87 has no distinctive dust lanes. Instead, it has an almost featureless, ellipsoidal shape typical of most giant elliptical galaxies, diminishing in luminosity with distance from the center. Forming around one-sixth of its mass, M87's stars have a nearly spherically symmetric distribution. Their population density decreases with increasing distance from the core. It has an active supermassive black hole at its core, which forms the primary component of an active galactic nucleus. The black hole was imaged using data collected in 2017 by the Event Horizon Telescope, with a final, processed image released on 10 April 2019.\nThe galaxy is a strong source of multiwavelength radiation, particularly radio waves. Its galactic envelope extends to a radius of about 150 kiloparsecs (490,000 light-years), where it is truncated—possibly by an encounter with another galaxy. Its interstellar medium consists of diffuse gas enriched by elements emitted from evolved stars."
    },

    "m88": {
        "to": "Messier 88",
        "title": "Messier 88",
        "extract": "Messier 88 (also known as M88 or NGC 4501) is a spiral galaxy about 50 to 60 million light-years away in the constellation Coma Berenices. It was discovered by Charles Messier in 1781."
    },

    "m89": {
        "to": "Messier 89",
        "title": "Messier 89",
        "extract": "Messier 89 (M89 for short, also known as NGC 4552) is an elliptical galaxy in the constellation Virgo. It was discovered by Charles Messier on March 18, 1781. M89 is a member of the Virgo Cluster of galaxies."
    },

    "m90": {
        "to": "Messier 90",
        "title": "Messier 90",
        "extract": "Messier 90 (also known as M90 and NGC 4569) is an intermediate spiral galaxy exhibiting a weak inner ring structure about 60 million light-years away in the constellation Virgo. It was discovered by Charles Messier in 1781."
    },

    "m91": {
        "to": "Messier 91",
        "title": "Messier 91",
        "extract": "Messier 91 (also known as NGC 4548 or M91) is a barred spiral galaxy located in the Coma Berenices constellation and is part of the Virgo Cluster of galaxies. M91 is about 63 million light-years away from the earth. It was the last of a group of eight nebulae discovered by Charles Messier in 1781.\nOriginally M91 was a missing Messier object in the catalogue as the result of a bookkeeping mistake by Messier. It was not until 1969 that amateur astronomer William C. Williams realized that M91 was NGC 4548, which was documented by William Herschel in 1784 (according to other sources, however, the nearby spiral galaxy NGC 4571 was also considered as a candidate for Messier 91 by him.)"
    },

    "m92": {
        "to": "Messier 92",
        "title": "Messier 92",
        "extract": "Messier 92 (also known as M92, M 92, or NGC 6341) is a globular cluster of stars in the northern constellation of Hercules. It was discovered by Johann Elert Bode in 1777, then published in the Jahrbuch during 1779. The cluster was independently rediscovered by Charles Messier on March 18, 1781 and added as the 92nd entry in his catalogue. M92 is at a distance of about 26,700 light-years away from Earth.\nM92 is one of the brighter globular clusters in the northern hemisphere, but it is often overlooked by amateur astronomers because of its proximity to the even more spectacular Messier 13. It is visible to the naked eye under very good conditions.Among the Milky Way population of globular clusters, Messier 92 is among the brighter clusters in terms of absolute magnitude. It is also one of the oldest clusters. Messier 92 is located around 16×10^3 ly (4.9 kpc) above the galactic plane and 33×10^3 ly (10 kpc) from the Galactic Center. The heliocentric distance of Messier 92 is 26.7×10^3 ly (8.2 kpc). The half-light radius, or radius containing half of the light emission from the cluster, is 1.09 arcminutes, while the tidal radius is 15.17 arcminutes. It appears only slightly flattened, with the minor axis being about 89% ± 3% as large as the major axis.Characteristic of other globulars, Messier 92 has a very low abundance of elements other than hydrogen and helium; what astronomers term its metallicity. Relative to the Sun, the abundance of iron in the cluster is given by [Fe/H] = –2.29 dex, which equates to only 0.5% of the solar abundance. This puts the estimated age range for the cluster at 14.2 ± 1.2 billion years, or roughly the age of the Universe.The cluster is not currently in a state of core collapse and the core radius is about 2 arcseconds. It is an Oosterhoff type II (OoII) globular cluster, which means it belongs to the group of metal poor clusters with longer period RR Lyrae variable stars. The 1997 Catalogue of Variable Stars in Globular Clusters listed 28 candidate variable stars in the cluster, although only 20 have been confirmed. As of 2001, there are 17 known RR Lyrae variables in Messier 92. 10 X-ray sources have been detected within the 1.02 arcminute half-mass radius of the cluster, of which half are candidate cataclysmic variable stars."
    },

    "m93": {
        "to": "Messier 93",
        "title": "Messier 93",
        "extract": "Messier 93 or M93, also known as NGC 2447, is an open cluster in the constellation Puppis. It was discovered by Charles Messier then added to his catalogue of comet-like objects on March 20, 1781. Caroline Herschel, the younger sister of William Herschel, independently discovered M93 in 1783, thinking it had not yet been catalogued by Messier. Walter Scott Houston described its appearance as follows:\n\nSome observers mention the cluster as having the shape of a starfish.  With a fair-sized telescope, this is its appearance on a dull night, but [a four-inch refractor] shows it as a typical star-studded galactic cluster.\n\nIt has a Trumpler class of I 3 r, indicating it is strongly concentrated (I) with a large range in brightness (3) and is rich in stars (r).M93 is at a distance of about 3,380 light years from Earth and has a spatial radius of some 5 light years, a tidal radius of 13.1±2.3 ly, and a core radius of 4.2 ly. Its age is estimated at 387.3 million years. The cluster is positioned nearly on the galactic plane and it is following an orbit that varies between 28–29 kly (8.5–8.9 kpc) from the Galactic Center over a period of 242.7±7.9 Myr.54 variable stars have been found in M93, including one slowly pulsating B-type star, one rotating ellipsoidal variable, seven Delta Scuti variables, six Gamma Doradus variables, and one hybrid δ Sct/γ Dor pulsator. Four spectroscopic binary systems in M93 include a yellow straggler component."
    },

    "m94": {
        "to": "Messier 94",
        "title": "Messier 94",
        "extract": "Messier 94 (also known as NGC 4736) is a spiral galaxy in the constellation Canes Venatici.  It was discovered by Pierre Méchain in 1781,\nand catalogued by Charles Messier two days later.  Although some references describe M94 as a barred spiral galaxy, the \"bar\" structure appears to be more oval-shaped.  The galaxy has two ring structures."
    },

    "m95": {
        "to": "Messier 95",
        "title": "Messier 95",
        "extract": "Messier 95, also known as M95 or NGC 3351, is a barred spiral galaxy located about 33 million light-years away in the zodiac constellation Leo. It was discovered by Pierre Méchain in 1781, and catalogued by fellow French astronomer Charles Messier four days later. On 16 March 2012, a supernova was discovered in M95.\nThe galaxy has a morphological classification of SB(r)b, with the SBb notation indicating it is a barred spiral with arms that are intermediate on the scale from tightly to loosely wound, and an '(r)' meaning an inner ring surrounds the bar. The latter is a ring-shaped, circumnuclear star-forming region with a diameter of approximately 2,000 light-years (610 pc). The spiral structure extends outward from the ring.The ring structure of M95 has a mass of 3.5×108 M☉ in molecular gas and a star formation rate of 0.38 M☉ yr−1. The star formation is occurring in at least five regions with diameters between 100 and 150 pc that are composed of several star clusters ranging in size from 1.7 to 4.9 pc. These individual clusters contain (1.8–8.7)×106 M☉ of stars, and may be on the path to forming globular clusters.A Type II supernova, designated as SN 2012aw, was discovered in M95 on 16 March 2012. The light curve of the supernova displayed a significant flattening after 27 days, thus classifying it as a Type II-P, or \"plateau\", core-collapse supernova. The disappearance of the progenitor star was later confirmed from near-infrared imaging of the region. The brightness of the presumed red supergiant progenitor allowed its mass to be estimated as 12.5±1.5 M☉.M95 is one of several galaxies within the M96 Group, a group of galaxies in the constellation Leo.  The group also includes the Messier objects M96 and M105."
    },

    "m96": {
        "to": "Messier 96",
        "title": "Messier 96",
        "extract": "Messier 96 (also known as M96 or NGC 3368) is an intermediate spiral galaxy about 31 million light-years away in the constellation Leo (the Lion). It was discovered by French astronomer Pierre Méchain on March 20, 1781. After communicating his finding, French astronomer Charles Messier confirmed the finding four days later and added it to his catalogue of nebulous objects. Finding this object is extremely difficult with binoculars. With a telescope of 25.4 cm (10.0 in) aperture, the galaxy is visible as a 3 × 5 arcminute halo with a brighter core region.This complex galaxy is inclined by an angle of about 53° to the line of sight from the Earth, which is oriented at a position angle of 172°. It is categorized as a double-barred spiral galaxy with a small inner bulge through the core along with an outer bulge. The nucleus displays a weak level of activity of the LINER2 type. Variations in ultraviolet emission from the core suggest the presence of a supermassive black hole. Estimates for the mass of this object range from 1.5×106 to 4.8×107 times the mass of the Sun.On May 9, 1998 a supernova event was observed in this galaxy. Designated SN 1998bu, this was a Type Ia supernova explosion. It reached maximum light on May 21, then steadily declined in magnitude thereafter. Observations of the ejecta a year later showed that the explosion created 0.4 times the mass of the Sun worth of iron. The spectrum of the supernova remnant confirmed the presence of radioactive 56Co, which decays into 56Fe.Messier 96 is about the same mass and size as the Milky Way. It is a very asymmetric galaxy; its dust and gas are unevenly spread throughout its weak spiral arms, and its core is not exactly at the galactic center. Its arms are also asymmetrical, thought to have been influenced by the gravitational pull of other galaxies within the same group as Messier 96.\nMessier 96 is being studied as part of a survey of 50 nearby galaxies known as the Legacy ExtraGalactic UV Survey (LEGUS), providing an unprecedented view of star formation within the local Universe."
    },

    "m97": {
        "to": "Messier 97",
        "title": "Owl Nebula",
        "extract": "The Owl Nebula (also known as Messier 97, M97 or NGC 3587) is a planetary nebula located approximately 2,030 light years away in the constellation Ursa Major.  It was discovered by French astronomer Pierre Méchain on February 16, 1781. When William Parsons, 3rd Earl of Rosse, observed the nebula in 1848, his hand-drawn illustration resembled an owl's head. It has been known as the Owl Nebula ever since.The nebula is approximately 8,000 years old. It is approximately circular in cross-section with a little visible internal structure. It was formed from the outflow of material from the stellar wind of the central star as it evolved along the asymptotic giant branch. The nebula is arranged in three concentric shells, with the outermost shell being about 20–30% larger than the inner shell. The owl-like appearance of the nebula is the result of an inner shell that is not circularly symmetric, but instead forms a barrel-like structure aligned at an angle of 45° to the line of sight.The nebula holds about 0.13 solar masses of matter, including hydrogen, helium, nitrogen, oxygen, and sulfur; all with a density of less than 100 particles per cubic centimeter. Its outer radius is around 0.91 ly (0.28 pc) and it is expanding with velocities in the range of 27–39 km/s into the surrounding interstellar medium.The 14th magnitude central star has since reached the turning point of its evolution where it condenses to form a white dwarf. It has 55–60% of the Sun's mass, 41–148 times the brightness of the Sun, and an effective temperature of 123,000 K. The star has been successfully resolved by the Spitzer Space Telescope as a point source that does not show the infrared excess characteristic of a circumstellar disk."
    },

    "m98": {
        "to": "Messier 98",
        "title": "Messier 98",
        "extract": "Messier 98, also known as M98 or NGC 4192, is an intermediate spiral galaxy located about 44.4 million light-years away in the constellation Coma Berenices, about 6° to the east of the bright star Denebola. It was discovered by French astronomer Pierre Méchain on 15 March 1781, along with nearby M99 and M100, and was cataloged by French astronomer Charles Messier on 13 April 1781 in his Catalogue des Nébuleuses & des amas d'Étoiles. Messier 98 has a blue shift and is approaching us at about 140 km/s.The morphological classification of this galaxy is SAB(s)ab, which indicates it is a spiral galaxy that displays mixed barred and non-barred features with intermediate to tightly-wound arms and no ring. It is highly inclined to the line of sight at an angle of 74° and has a maximum rotation velocity of 236 km/s. The combined mass of the stars in this galaxy is an estimated 76 billion (7.6 × 1010) times the mass of the Sun. It contains about 4.3 billion solar masses of neutral hydrogen and 85 million solar masses in dust. The nucleus is active, displaying characteristics of a \"transition\" type object. That is, it shows properties of a LINER-type galaxy intermixed with an H II region around the nucleus.Messier 98 is a member of the Virgo Cluster, which is a large, relatively nearby cluster of galaxies. About 750 million years ago, Messier 98 may have interacted with the large spiral galaxy Messier 99. The two are now separated by a distance of 1,300,000 ly (400,000 pc)."
    },

    "m99": {
        "to": "Messier 99",
        "title": "Messier 99",
        "extract": "Messier 99 or M99, also known as NGC 4254, is a grand design spiral galaxy in the northern constellation Coma Berenices approximately 15 megaparsecs (49 megalight-years) in distance from the Milky Way. It was discovered by Pierre Méchain on March 17, 1781. The discovery was then reported to Charles Messier, who included the object in the Messier Catalogue of comet-like objects. Messier 99 was one of the first galaxies in which a spiral pattern was seen. This pattern was first identified by Lord Rosse in the spring of 1846.This galaxy has a morphological classification of SA(s)c, indicating a pure spiral shape with loosely wound arms. It has a peculiar shape with one normal looking arm and an extended arm that is less tightly wound. The galaxy is inclined by 42° to the line-of-sight with a major axis position angle of 68°. Four supernovae have been observed in this galaxy: SN 1967H (type II), 1972Q, 1986I (type II), and 2014L (type Ic).A bridge of neutral hydrogen gas links NGC 4254 with VIRGOHI21, an HI region and a possible dark galaxy. The gravity from the latter may have distorted M99 and drawn out the gas bridge, as the two galaxy-sized objects may have had a close encounter before they went their separate ways. However, VIRGOHI21 may instead be tidal debris from an interaction with the lenticular galaxy NGC 4262 some 280 million years ago. It is expected that the drawn out arm will relax to match the normal arm once the encounter is over.\nWhile not classified as a starburst galaxy, M99 has a star formation activity three times larger than other galaxies of similar Hubble type that may have been triggered by the encounter. M99 is likely entering the Virgo Cluster for the first time and is located at the periphery of the cluster at a projected separation of 3.7°, or around one megaparsec, from the cluster center at Messier 87. The galaxy is undergoing ram-pressure stripping as it moves through the intracluster medium."
    },

    "m100": {
        "to": "Messier 100",
        "title": "Messier 100",
        "extract": "Messier 100 (also known as NGC 4321) is an example of a grand design intermediate spiral galaxy located within the southern part of constellation Coma Berenices. It is one of the brightest and largest galaxies in the Virgo Cluster, located approximately 55 million light-years distant from Earth and has a diameter of 107,000 light years, roughly 60% the size of the Milky Way. It was discovered by Pierre Méchain on March 15, 1781 and was subsequently entered in Messier's catalogue of nebulae and star clusters after Charles Messier made observations of his own on April 13, 1781. The galaxy was one of the first spiral galaxies to be discovered, and was listed as one of fourteen spiral nebulae by Lord William Parsons of Rosse in 1850. Two satellite galaxies named NGC 4323--connected with M100 by a bridge of luminous matter--and NGC 4328 surround M100."
    },

    "m101": {
        "to": "Messier 101",
        "title": "Pinwheel Galaxy",
        "extract": "The Pinwheel Galaxy (also known as Messier 101, M101 or NGC 5457) is a face-on spiral galaxy distanced 21 million light-years (six megaparsecs) away from Earth in the constellation Ursa Major.  Discovered by Pierre Méchain on March 27, 1781, it was communicated to Charles Messier who verified its position for inclusion in the Messier Catalogue as one of its final entries.\nOn February 28, 2006, NASA and the European Space Agency released a very detailed image of the Pinwheel Galaxy, which was the largest and most detailed image of a galaxy by Hubble Space Telescope at the time. The image was composed of 51 individual exposures, plus some extra ground-based photos.\nOn August 24, 2011, a Type Ia supernova, SN 2011fe, was discovered in M101."
    },

    "m102": {
        "to": "Messier 102",
        "title": "Messier 102",
        "extract": "Messier 102 (also known as M102) is a galaxy listed in the Messier Catalogue that has not been identified unambiguously. Its original discoverer Pierre Méchain later said that it was a duplicate observation of Messier 101, but more recent historical evidence favors that it is NGC 5866, although other galaxies have been suggested as possible identities."
    },

    "m103": {
        "to": "Messier 103",
        "title": "Messier 103",
        "extract": "Messier 103 (also known as M103, or NGC 581) is an open cluster where a few thousand stars formed in the constellation Cassiopeia. This open cluster was discovered in 1781 by Charles Messier's friend and collaborator Pierre Méchain. It is one of the most distant open clusters known, with distances of 8,000 to 9,500 light-years from the earth and ranging about 15 light-years apart. There are about 40 member stars within M103, two of which have magnitudes 10.5, and a 10.8 red giant, which is the brightest within the cluster. Observation of M103 is generally dominated by the appearance of Struve 131, though the star is not a member of the 172-star cluster. M103 is about 25 million years old."
    },

    "m104": {
        "to": "Messier 104",
        "title": "Sombrero Galaxy",
        "extract": "The Sombrero Galaxy (also known as Messier Object 104, M104 or NGC 4594) is a lenticular galaxy in the constellation Virgo found 9.55 megaparsecs (31.1 million light-years) from Earth. The galaxy has a diameter of approximately 15 kiloparsecs (49,000 light-years), 30% the size of the Milky Way. It has a bright nucleus, an unusually large central bulge, and a prominent dust lane in its inclined disk. The dark dust lane and the bulge give this galaxy the appearance of a sombrero hat. Astronomers initially thought that the halo was small and light, indicative of a spiral galaxy, but the Spitzer Space Telescope found that the dust ring around the Sombrero Galaxy is larger and more massive than previously thought, indicative of a giant elliptical galaxy. The galaxy has an apparent magnitude of +8.0, making it easily visible with amateur telescopes, and it is considered by some authors to be the galaxy with the highest absolute magnitude within a radius of 10 megaparsecs of the Milky Way. Its large bulge, its central supermassive black hole, and its dust lane all attract the attention of professional astronomers."
    },

    "m105": {
        "to": "Messier 105",
        "title": "Messier 105",
        "extract": "Messier 105 or M105, also known as NGC 3379, is an elliptical galaxy located 36.6 million light years away in the equatorial constellation of Leo. It was discovered by Pierre Méchain on 24 March 1781, just a few days after he discovered the nearby galaxies Messier 95 and Messier 96. This galaxy is one of several that were not originally included in the original Messier Catalogue compiled by Charles Messier. Messier 105 was included in the catalog only when Helen S. Hogg found a letter by Méchain describing Messier 105 and when the object described by Méchain was identified as a galaxy previously named NGC 3379.This galaxy has a morphological classification of E1, indicating a standard elliptical galaxy with a flattening of 10%. The major axis is aligned along a position angle of 71°. Isophotes of the galaxy are near perfect ellipses, twisting no more than 5° out of alignment, with changes in ellipticity of no more than 0.06. There is no fine structure apparent in the isophotes, such as ripples. Observation of giant stars in the halo indicate there are two general populations: a dominant metal-rich subpopulation and a weaker metal-poor group.Messier 105 is known to have a supermassive black hole at its core whose mass is estimated to be between 1.4×108 and 2×108 M☉. The galaxy has a weak active galactic nucleus of the LINER type with a spectral class of L2/T2, meaning no broad Hα line and intermediate emission line ratios between a LINER and a H II region. The galaxy also contains a few young stars and stellar clusters, suggesting some elliptical galaxies still form new stars, but very slowly.This galaxy, along with its companion the barred lenticular galaxy NGC 3384, is surrounded by an enormous ring of neutral hydrogen with a radius of 200 kiloparsecs (650 kilolight-years) and a mass of 1.8×109 M☉ where star formation has been detected. Messier 105 is one of several galaxies within the M96 Group (also known as the Leo I Group), a group of galaxies in the constellation Leo. The group also includes the Messier objects M95 and M96."
    },

    "m106": {
        "to": "Messier 106",
        "title": "Messier 106",
        "extract": "Messier 106 (also known as NGC 4258) is an intermediate spiral galaxy in the constellation Canes Venatici. It was discovered by Pierre Méchain in 1781. M106 is at a distance of about 22 to 25 million light-years away from Earth. M106 contains an active nucleus classified as a Type 2 Seyfert, and the presence of a central supermassive black hole has been demonstrated from radio-wavelength observations of the rotation of a disk of molecular gas orbiting within the inner light-year around the black hole.  NGC 4217 is a possible companion galaxy of Messier 106. A Type II supernova was observed in M106 in May 2014."
    },

    "m107": {
        "to": "Messier 107",
        "title": "Messier 107",
        "extract": "Messier 107 or M107, also known as NGC 6171, is a very loose globular cluster in the constellation Ophiuchus, and is the last globular cluster in the Messier Catalogue. It was discovered by Pierre Méchain in April 1782, then independently by William Herschel in 1793. Herschel described it as a \"globular cluster of stars, large, very rich, very much compressed, round, well resolved, clearly consisting of stars\". It was not until 1947 that Helen Sawyer Hogg added it and three other objects discovered by Méchain to the list of Messier objects. The cluster is located 2.5° south and slightly west of the star Zeta Ophiuchi.M107 is close to the galactic plane at a distance of about 20,900 light-years from Earth and 9.8 kly (3.0 kpc) from the Galactic Center. The orbit of this cluster carries it through the galaxy between 9.2–12.4 kly (2.82–3.79 kpc) from the Galactic Center, with the perigalactic distance laying within the galactic bar region. It is an Oosterhoff type I cluster with a metallicity of –0.95 and is considered part of the halo population. There are 22 known RR Lyrae variable stars in this cluster and a probable SX Phoenicis variable."
    },

    "m108": {
        "to": "Messier 108",
        "title": "Messier 108",
        "extract": "Messier 108 (also known as NGC 3556) is a barred spiral galaxy in the constellation Ursa Major. It was discovered by Pierre Méchain in 1781 or 1782. From the perspective of the Earth, this galaxy is seen almost edge-on.\nThis galaxy is an isolated member of the Ursa Major Cluster of galaxies in the Virgo supercluster. It has a morphological classification of type SBbc in the de Vaucouleurs system, which means it is a barred spiral galaxy with somewhat loosely wound arms. The maximum angular size of the galaxy in the optical band is 11′.1 × 4′.6, and it is inclined 75° to the line of sight.This galaxy has an estimated mass of 125 billion times the mass of the Sun and includes about 290 ± 80 globular clusters. Examination of the distribution of neutral hydrogen in this galaxy shows shells of expanding gas extending for several kiloparsecs, known as H1 supershells. These may be driven by bursts of star formation activity, resulting in supernovae explosions. Alternatively they  may result from an infall of gas from outside the galaxy or by radio jets.Observations with the Chandra X-ray Observatory have identified 83 X-ray sources, including a source located at the nucleus. The brightest of these sources may be an intermediate-mass black hole that is accreting matter. The galaxy is also emitting a diffuse soft X-ray radiation within 10 kpc of the optical galaxy. The spectrum of the X-ray source at the core is consistent with an active galactic nucleus, but an examination with the Spitzer Space Telescope shows no indication of activity. The supermassive black hole at the core has an estimated mass equal to 24 million times the mass of the Sun."
    },

    "m109": {
        "to": "Messier 109",
        "title": "Messier 109",
        "extract": "Messier 109 (also known as NGC 3992) is a barred spiral galaxy exhibiting a weak inner ring structure around the central bar approximately 83.5 ± 24 million light-years away in the constellation Ursa Major.  M109 can be seen southeast of the star Phecda (γ UMa)."
    },

    "m110": {
        "to": "Messier 110",
        "title": "Messier 110",
        "extract": "Messier 110, or M110, also known as NGC 205, is a dwarf elliptical galaxy that is a satellite of the Andromeda Galaxy. Although Charles Messier never included the galaxy in his list, it was depicted by him, together with M32, on a drawing of the Andromeda Galaxy; a label on the drawing indicates that Messier first observed NGC 205 on August 10, 1773. The galaxy was independently discovered by Caroline Herschel on August 27, 1783; her brother William Herschel described her discovery in 1785. The suggestion to assign the galaxy a Messier number was made by Kenneth Glyn Jones in 1967, making it the last member of the Messier List.\nThis galaxy has a morphological classification of pec dE5, indicating a dwarf elliptical galaxy with a flattening of 50%. M110 is designated peculiar because there are patches of dust and young blue stars located near the center. This is unusual for dwarf elliptical galaxies in general, and the reason for this peculiarity is unclear. Unlike M32, NGC 205 does not (as of 2005) show evidence for a supermassive black hole at its center.The interstellar dust in M110 has a mass of (1.1–1.8)×104 M☉ with a temperature of 18–22 K, and the interstellar gas has (4–7)×106 M☉. The inner regions of M110 show a deficiency in the interstellar medium (IM) materials, which most likely were ejected by supernova explosions. Tidal interactions with M31 may have stripped away a significant fraction of the expelled gas and dust, leaving the galaxy as a whole deficient in its IM density.A few novae have been detected in this galaxy, including one discovered in 1999 by Johnson and Modjaz, and another detected in 2002, by Nakano and Sumoto. The latter, designated EQ J004015.8+414420, had also been captured in images taken by the Sloan Digital Sky Survey (SDSS) in October, 2002.About half of the Andromeda's satellite galaxies are orbiting the host galaxy along a highly flattened plane, with 14 out of 16 following the same sense of rotation. One theory proposes that these objects once belonged to a subhalo surrounding NGC 205, then the group was broken up by tidal forces during a close encounter with Andromeda."
    }
}